MandM/Methods.org
* Installation of Atlantis
** The basic program an libraries to run Atlantis
*** Check if is installed
dpkg -l | grep build-essential   # Esscential packages to build debian
dpkg -l | grep autoconf          # Automatic configure script builder
dpkg -l | grep subversion        # Version Control System (like GITHUB)
dpkg -l | grep gawk              # GNU version de Awk
dpkg -l | grep proj              # Program Proj.4 Cartographic projection
dpkg -l | grep libxml2-dev       # Library for XML lenguaje
dpkg -l | grep libnetcdf-dev     # Library of development kit for NetCDF
dpkg -l | grep flip              # convert text file line endings between Unix and DOS

*** Install and installation check of libraries [7/7]
- [X] sudo apt-get install build-essential
- [X] sudo apt-get install autoconf
- [X] sudo apt-get install subversion
- [X] sudo apt-get install libxml2-dev
- [X] sudo apt-get install libnetcdf-dev
- [X] sudo apt-get install gawk
- [X] install proj.4
    wget http://download.osgeo.org/proj/proj-4.9.1.tar.gz
    mkdir ~/proj
    mv Download/proj-4.9.1.tar.gz ~/proj/
    tar -zxvf proj-4.9.1.tar.gz
    cd proj-4.9.1
    sudo ./configure
    sudo make
    sudo make install

** Installation of Atlantis
*** Checkout [3/3]
- [X] cd  /home/demiurgo/Documents/2015/Atlantis_Model
- [X] Checkout Atlantis
  svn co  https://svnserv.csiro.au/svn/atlantis/Atlantis/trunk/
- [X] Checkout SETas
  svn co  https://svnserv.csiro.au/svn/atlantis/runFiles/trunk/SETas_model_New

*** Update [0/2]
- [ ] Update
    svn update SETas_model_New
    svn update trunk
- [ ] If I udate I need to build atlantis again

*** Build Atlantis [9/9]
# to build Atlantis I need t compile and run using aototools
- [X] cd  /home/demiurgo/Documents/2015/Atlantis_Model/trunk/atlantis
- [X] aclocal
- [X] autoconf
- [X] automake -a               # I have some problems with this section
- [X] autoreconf  -fvi               # you can use this instead of the other ones
- [X] sudo chmod +x configure   #  Change the permissions to the configure script
- [X] ./configure
- [X] make
- [X] sudo make install
*** Chanche between DOS-mode to UNIX-mode [2/2]
 + It is necesary to change the mode of the codification of the text files of the setas folder
 + [X] cd /home/demiurgo/Documents/2015/Atlantis_Model/SETas_model_New/
 + [X] flip -uvt *.*
* Runing Atlantis
** Nescesary files
- [ ] atlantisMerged
- [ ] init_vmpa_setas_25032013.nc
- [ ] outputSETAS.nc
- [ ] VMPA_setas_run_fishing_F_Dem.prm
- [ ] VMPA_setas_force_fish_Dem.prm
- [ ] VMPA_setas_physics.prm
- [ ] VMPA_setas_biol_fishing_Dem.prm
- [ ] VMPA_setas_harvest_F_New.prm
- [ ] SETasGroupsDem_NoCep.csv
- [ ] SETasFisheries.csv
- [ ] outputFolderTrunk
** Run the model called the SETas (Unix != DOS)
 -  atlantisMerged -i init_vmpa_setas_25032013.nc 0 -o outputSETAS.nc -r VMPA_setas_run_fishing_F_Dem.prm -f VMPA_setas_force_fish_Dem.prm -p VMPA_setas_physics.prm -b VMPA_setas_biol_fishing_Dem.prm -h VMPA_setas_harvest_F_New.prm -s SETasGroupsDem_NoCep.csv -q SETasFisheries.csv -d outputFolderTrunk

* Zones
** using Qgis for the definition of the polygos
** The polygons are defined by species distribution, managemet areas and Oceanography
