MandM/Methods.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>tester.org</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="tester.org"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-09-13T16:50+1000"/>
<meta name="author" content="Javier Porobic"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">tester.org</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Installation of Atlantis</a>
<ul>
<li><a href="#sec-1-1">1.1 The basic program an libraries to run Atlantis</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 Check if is installed</a></li>
<li><a href="#sec-1-1-2">1.1.2 Install and installation check of libraries [7/7]</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 Installation of Atlantis</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Checkout [3/3]</a></li>
<li><a href="#sec-1-2-2">1.2.2 Update [0/2]</a></li>
<li><a href="#sec-1-2-3">1.2.3 Build Atlantis [9/9]</a></li>
<li><a href="#sec-1-2-4">1.2.4 Chanche between DOS-mode to UNIX-mode [2/2]</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Runing Atlantis</a>
<ul>
<li><a href="#sec-2-1">2.1 Nescesary files</a></li>
<li><a href="#sec-2-2">2.2 Run the model called the SETas (Unix != DOS)</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Zones</a>
<ul>
<li><a href="#sec-3-1">3.1 using Qgis for the definition of the polygos</a></li>
<li><a href="#sec-3-2">3.2 The polygons are defined by species distribution, managemet areas and Oceanography</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 The polygons need to have</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3 I generate a Shape file with the poligons. I need to know:</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Oceanography</a>
<ul>
<li><a href="#sec-4-1">4.1 I will use the Roms model</a></li>
<li><a href="#sec-4-2">4.2 The variables that I plan tu use are:</a></li>
<li><a href="#sec-4-3">4.3 Getting the physics</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1 Getting the code</a></li>
<li><a href="#sec-4-3-2">4.3.2 Running the code</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4 Using Hydrocontruct</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1 Getting the code</a></li>
</ul>
</li>
<li><a href="#sec-4-5">4.5 physics parameter file</a>
<ul>
<li><a href="#sec-4-5-1">4.5.1 Settings</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 Setting Atlantis</a>
<ul>
<li><a href="#sec-5-1">5.1 CSV files</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1 SETasfishery</a></li>
<li><a href="#sec-5-1-2">5.1.2 SETasGroups</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2 PRM files</a>
<ul>
<li><a href="#sec-5-2-1">5.2.1 Biology input file</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Installation of Atlantis</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> The basic program an libraries to run Atlantis</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Check if is installed</h4>
<div class="outline-text-4" id="text-1-1-1">

<p>dpkg -l | grep build-essential   # Esscential packages to build debian
dpkg -l | grep autoconf          # Automatic configure script builder
dpkg -l | grep subversion        # Version Control System (like GITHUB)
dpkg -l | grep gawk              # GNU version de Awk
dpkg -l | grep proj              # Program Proj.4 Cartographic projection
dpkg -l | grep libxml2-dev       # Library for XML lenguaje
dpkg -l | grep libnetcdf-dev     # Library of development kit for NetCDF
dpkg -l | grep flip              # convert text file line endings between Unix and DOS
</p>
</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Install and installation check of libraries [7/7]</h4>
<div class="outline-text-4" id="text-1-1-2">

<ul>
<li><code>[X]</code> sudo apt-get install build-essential
</li>
<li><code>[X]</code> sudo apt-get install autoconf
</li>
<li><code>[X]</code> sudo apt-get install subversion
</li>
<li><code>[X]</code> sudo apt-get install libxml2-dev
</li>
<li><code>[X]</code> sudo apt-get install libnetcdf-dev
</li>
<li><code>[X]</code> sudo apt-get install gawk
</li>
<li><code>[X]</code> install proj.4
    wget <a href="http://download.osgeo.org/proj/proj-4.9.1.tar.gz">http://download.osgeo.org/proj/proj-4.9.1.tar.gz</a>
    mkdir ~/proj
    mv Download/proj-4.9.1.tar.gz ~/proj/
    tar -zxvf proj-4.9.1.tar.gz
    cd proj-4.9.1
    sudo ./configure
    sudo make
    sudo make install
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Installation of Atlantis</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Checkout [3/3]</h4>
<div class="outline-text-4" id="text-1-2-1">

<ul>
<li><code>[X]</code> cd  /home/demiurgo/Documents/2015/Atlantis<sub>Model</sub>
</li>
<li><code>[X]</code> Checkout Atlantis
  svn co  <a href="https://svnserv.csiro.au/svn/atlantis/Atlantis/trunk/">https://svnserv.csiro.au/svn/atlantis/Atlantis/trunk/</a>
</li>
<li><code>[X]</code> Checkout SETas
  svn co  <a href="https://svnserv.csiro.au/svn/atlantis/runFiles/trunk/SETas_model_New">https://svnserv.csiro.au/svn/atlantis/runFiles/trunk/SETas_model_New</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Update [0/2]</h4>
<div class="outline-text-4" id="text-1-2-2">

<ul>
<li><code>[&nbsp;]</code> Update
    svn update SETas<sub>model</sub><sub>New</sub>
    svn update trunk
</li>
<li><code>[&nbsp;]</code> If I udate I need to build atlantis again
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Build Atlantis [9/9]</h4>
<div class="outline-text-4" id="text-1-2-3">

<ul>
<li><code>[X]</code> cd  /home/demiurgo/Documents/2015/Atlantis<sub>Model</sub>/trunk/atlantis
</li>
<li><code>[X]</code> aclocal
</li>
<li><code>[X]</code> autoconf
</li>
<li><code>[X]</code> automake -a               # I have some problems with this section
</li>
<li><code>[X]</code> autoreconf  -fvi               # you can use this instead of the other ones
</li>
<li><code>[X]</code> sudo chmod +x configure   #  Change the permissions to the configure script
</li>
<li><code>[X]</code> ./configure
</li>
<li><code>[X]</code> make
</li>
<li><code>[X]</code> sudo make install
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Chanche between DOS-mode to UNIX-mode [2/2]</h4>
<div class="outline-text-4" id="text-1-2-4">

<ul>
<li>It is necesary to change the mode of the codification of the text files of the setas folder
</li>
<li><code>[X]</code> cd <i>home/demiurgo/Documents/2015/Atlantis<sub>Model</sub>/SETas<sub>model</sub><sub>New</sub></i>
</li>
<li><code>[X]</code> flip -uvt <b>.</b>
</li>
</ul>

</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Runing Atlantis</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Nescesary files</h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li><code>[&nbsp;]</code> atlantisMerged
</li>
<li><code>[&nbsp;]</code> init<sub>vmpa</sub><sub>setas</sub><sub>25032013</sub>.nc
</li>
<li><code>[&nbsp;]</code> outputSETAS.nc
</li>
<li><code>[&nbsp;]</code> VMPA<sub>setas</sub><sub>run</sub><sub>fishing</sub><sub>F</sub><sub>Dem</sub>.prm
</li>
<li><code>[&nbsp;]</code> VMPA<sub>setas</sub><sub>force</sub><sub>fish</sub><sub>Dem</sub>.prm
</li>
<li><code>[&nbsp;]</code> VMPA<sub>setas</sub><sub>physics</sub>.prm
</li>
<li><code>[&nbsp;]</code> VMPA<sub>setas</sub><sub>biol</sub><sub>fishing</sub><sub>Dem</sub>.prm
</li>
<li><code>[&nbsp;]</code> VMPA<sub>setas</sub><sub>harvest</sub><sub>F</sub><sub>New</sub>.prm
</li>
<li><code>[&nbsp;]</code> SETasGroupsDem<sub>NoCep</sub>.csv
</li>
<li><code>[&nbsp;]</code> SETasFisheries.csv
</li>
<li><code>[&nbsp;]</code> outputFolderTrunk
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Run the model called the SETas (Unix != DOS)</h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li>atlantisMerged -i init<sub>vmpa</sub><sub>setas</sub><sub>25032013</sub>.nc 0 -o outputSETAS.nc -r VMPA<sub>setas</sub><sub>run</sub><sub>fishing</sub><sub>F</sub><sub>Dem</sub>.prm -f VMPA<sub>setas</sub><sub>force</sub><sub>fish</sub><sub>Dem</sub>.prm -p VMPA<sub>setas</sub><sub>physics</sub>.prm -b VMPA<sub>setas</sub><sub>biol</sub><sub>fishing</sub><sub>Dem</sub>.prm -h VMPA<sub>setas</sub><sub>harvest</sub><sub>F</sub><sub>New</sub>.prm -s SETasGroupsDem<sub>NoCep</sub>.csv -q SETasFisheries.csv -d outputFolderTrunk
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Zones</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> using Qgis for the definition of the polygos</h3>
<div class="outline-text-3" id="text-3-1">

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> The polygons are defined by species distribution, managemet areas and Oceanography</h3>
<div class="outline-text-3" id="text-3-2">


</div>
