MandM/Methods.org
*** The polygons need to have
1. Each box must have a "box_id" integer attribute, which must be consecutively numbered, starting from 0.  The absence of this attribute, or any gaps in the numbering, cause the transformation to abort.
2. Each box must have a "boundary" integer attribute.  This should be set to 1 for every boundary box, and 0 otherwise.  The absence of this attribute will cause the transformation to abort.  It will also abort if box 0 is not marked as a boundary box, or if box 1 is marked as a boundary box.  Note: the tool does not at the moment attempt to verify that a boundary box is in fact on the boundary.
3. Each box must have a botz float attribute, which will be used in the bathymetry.  It may be either negative or positive, but will always be converted to negative.  It will also accept "depth" if botz is not found.
4. Each box can (read: "should") have a "vertmix" numeric attribute. If it is not present NaN will be used and you will have to add it correct it manually later.
5. Each box can (read: "should") have a "horizmix" numeric attribute. If it is not present NaN will be used and you will have to add it correct it manually later.
6. Islands should be represented as boxes with a depth of 0, not as empty regions. The conversion will abort if islands are detected.
7. File need to looks like
| box_id | Bounday | botz   | horizmix |     vermix |     area |
|--------+---------+--------+----------+------------+----------|
|      0 |       1 | - 4500 |        1 | 0.00000001 |  7945687 |
|      1 |       0 | - 3600 |        1 | 0.00000001 | 45389345 |
|      2 |       1 | - 4500 |        1 | 0.00000001 |   987728 |
|        |         |        |          |            |          |
|        |         |        |          |            |          |
** I generate a Shape file with the poligons. I need to know:
- Shape file from QGIS
- UTM projection - For Juan Fernandez is UTM 17H South

- check the shp file
v.in.ogr "dsn=/home/demiurgo/Documents/2015/Polygonos/qgis-project/JFR.shp" output=JFR0p001 snap=0.0001 min_area=0.0001 -o
- Using the Java lybrarie I need to run the follow code
rm JFRE_ll.bgm
java -jar bgmeriser-stripped.jar -as "+proj=longlat +ellps=WGS84 +datum=WGS84 +no_defs" JFRE_v3.shp JFRE_ll.bgm

rm JFRE_xy.bgm
java -jar bgmeriser-stripped.jar -from "+proj=longlat +ellps=WGS84 +datum=WGS84 +no_defs"  -to "+proj=utm +zone=19 +south +ellps=GRS80 +towgs84=0,0,0,0,0,0,0 +units=m +no_defs" JFRE_v3.shp JFRE_xy.bgm

* Oceanography
** I will use the Roms model
** The variables that I plan tu use are:
- CHLA
- temperature
- NO3
- w
- Salinity
** Getting the physics
*** Getting the code
   - svn co https://svnserv.csiro.au/svn/atlantis/Matlab/hydro/trunk/Public
   - I need to use my CSIRO account
*** Running the code
**** The layer that I create are based on the biology of the species and in the structure of the BMG file
- the max depth in the model need to be less than the max depth usen in the BMG file
**** Two steps to get the Oceanography, I'm using one file called roms2atlantis.m who is devided in three part:
***** Folders
- codes : '/home/demiurgo/Documents/2015/Atlantis_Model/tools/physics/Codes'
- ROMS  : '/media/demiurgo/TOSHIBA EXT/Data_fisica_AJF/ROMS/avg/**YEAR**'/Parent files
- outputs:
  - .mat files : '/home/demiurgo/Documents/2015/Oceanography/physics/output/**YEAR**'/'
  - .nc files  : '/home/demiurgo/Documents/2015/Oceanography/physics/output/Netcdf_out/'
***** Getting the polygos
- It is necesary to call the BMG file to obtatin the information of the polygons, to do this I use the function 'read.boxes'
- To calculate the transpors its necesary to know the faces of the polygos, for that I use the read_faces2 function
- Its  Necesary to define the layer depth, in my case and based on Biology and Oceanography I select 8 levels
****** Code In matlab
#+begin_src matlab
BGM_JFR_ll = '/home/demiurgo/Documents/2015/Oceanography/physics/BMG_files/JFRE_ll.bgm';
[nbox,nface,bid,cent,b_area,verts,iface, botz] = read_boxes(BGM_JFR_ll);
[nulr,nupt1,nupt2] = read_faces2(nbox, nface, bid,verts, iface, BGM_JFR_ll);


iface      = iface;  %% Id of the faces
lr         = nulr;   %% Neightbourn Layers
pt1        = nupt1;  %% Face 1
pt2        = nupt2;  %% Face 2
irealfaces = find(~isnan(nupt1(:,1)));  % (ie those ref'd in box definitions)
fcid       = (irealfaces-1);
rimn       = 10;     % default 3 is probably too few
dinc       = 1;      %% 0.1;   % default 10km is probably ok, esp for large boxes
                      % May want to reduce the face integration step 'dinc' for models with
                      % small or narrow boxes.
dlev = [0 20 50 150  250 400 650 1000 4300]; %% This structure is related with
                                             % the biology and with the
                                             % maximum deph in the BMG model
#+end_src

****** Functions
- read_boxes()
- read_faces2()
- transport_JFRE()
  - netcdf()      # NETCDF library
  - sigma2zeta()  # Depth at sigma layer based in the maximum depth
  - cart2pol()    # cartesian to polar (cilindrical) coordinates
  - cosd()        # cosine in degree
  - av2()         # grid average
  - rot2d()       # Rotate vectors by geometrics angle
  - Generic functions from matlab
- write_trans_file()
- box_av_JFRE
  - netcdf()
  - sigma2zeta()
- write_av_var()
***** Getting the transport
- I transform the transport in sigma layers to the depth layer in the JFRE polygons
- I devided the transport by years
- The function transport_JFRE it a bit hardcoded
- The output ist a netcd file
