MandM/Methods.html

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> The polygons need to have</h4>
<div class="outline-text-4" id="text-3-2-1">

<ol>
<li>Each box must have a "box<sub>id</sub>" integer attribute, which must be consecutively numbered, starting from 0.  The absence of this attribute, or any gaps in the numbering, cause the transformation to abort.
</li>
<li>Each box must have a "boundary" integer attribute.  This should be set to 1 for every boundary box, and 0 otherwise.  The absence of this attribute will cause the transformation to abort.  It will also abort if box 0 is not marked as a boundary box, or if box 1 is marked as a boundary box.  Note: the tool does not at the moment attempt to verify that a boundary box is in fact on the boundary.
</li>
<li>Each box must have a botz float attribute, which will be used in the bathymetry.  It may be either negative or positive, but will always be converted to negative.  It will also accept "depth" if botz is not found.
</li>
<li>Each box can (read: "should") have a "vertmix" numeric attribute. If it is not present NaN will be used and you will have to add it correct it manually later.
</li>
<li>Each box can (read: "should") have a "horizmix" numeric attribute. If it is not present NaN will be used and you will have to add it correct it manually later.
</li>
<li>Islands should be represented as boxes with a depth of 0, not as empty regions. The conversion will abort if islands are detected.
</li>
<li>File need to looks like
</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="right" /><col class="right" /><col class="left" /><col class="right" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="right">box<sub>id</sub></th><th scope="col" class="right">Bounday</th><th scope="col" class="left">botz</th><th scope="col" class="right">horizmix</th><th scope="col" class="right">vermix</th><th scope="col" class="right">area</th></tr>
</thead>
<tbody>
<tr><td class="right">0</td><td class="right">1</td><td class="left">- 4500</td><td class="right">1</td><td class="right">0.00000001</td><td class="right">7945687</td></tr>
<tr><td class="right">1</td><td class="right">0</td><td class="left">- 3600</td><td class="right">1</td><td class="right">0.00000001</td><td class="right">45389345</td></tr>
<tr><td class="right">2</td><td class="right">1</td><td class="left">- 4500</td><td class="right">1</td><td class="right">0.00000001</td><td class="right">987728</td></tr>
</tbody>
</table>

</div>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> I generate a Shape file with the poligons. I need to know:</h3>
<div class="outline-text-3" id="text-3-3">

<ul>
<li>Shape file from QGIS
</li>
<li>UTM projection - For Juan Fernandez is UTM 17H South

</li>
<li>check the shp file
</li>
</ul>

<p>v.in.ogr "dsn=/home/demiurgo/Documents/2015/Polygonos/qgis-project/JFR.shp" output=JFR0p001 snap=0.0001 min<sub>area</sub>=0.0001 -o
</p><ul>
<li>Using the Java lybrarie I need to run the follow code
</li>
</ul>

<p>rm JFRE<sub>ll</sub>.bgm
java -jar bgmeriser-stripped.jar -as "+proj=longlat +ellps=WGS84 +datum=WGS84 +no<sub>defs</sub>" JFRE<sub>v3</sub>.shp JFRE<sub>ll</sub>.bgm
</p>
<p>
rm JFRE<sub>xy</sub>.bgm
java -jar bgmeriser-stripped.jar -from "+proj=longlat +ellps=WGS84 +datum=WGS84 +no<sub>defs</sub>"  -to "+proj=utm +zone=19 +south +ellps=GRS80 +towgs84=0,0,0,0,0,0,0 +units=m +no<sub>defs</sub>" JFRE<sub>v3</sub>.shp JFRE<sub>xy</sub>.bgm
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Oceanography</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> I will use the Roms model</h3>
<div class="outline-text-3" id="text-4-1">

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> The variables that I plan tu use are:</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>CHLA
</li>
<li>temperature
</li>
<li>NO3
</li>
<li>w
</li>
<li>Salinity
</li>
</ul>

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Getting the physics</h3>
<div class="outline-text-3" id="text-4-3">


</div>

<div id="outline-container-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> Getting the code</h4>
<div class="outline-text-4" id="text-4-3-1">

<ul>
<li>svn co <a href="https://svnserv.csiro.au/svn/atlantis/Matlab/hydro/trunk/Public">https://svnserv.csiro.au/svn/atlantis/Matlab/hydro/trunk/Public</a>
</li>
<li>I need to use my CSIRO account
</li>
</ul>

</div>

</div>

<div id="outline-container-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> Running the code</h4>
<div class="outline-text-4" id="text-4-3-2">

<ul>
<li id="sec-4-3-2-1">The layer that I create are based on the biology of the species and in the structure of the BMG file<br/>
<ul>
<li>the max depth in the model need to be less than the max depth usen in the BMG file
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-4-3-2-2">Two steps to get the Oceanography, I'm using one file called roms2atlantis.m who is devided in three part:<br/>
<ul>
<li id="sec-4-3-2-2-1">Folders<br/>
<ul>
<li>codes : '/home/demiurgo/Documents/2015/Atlantis<sub>Model</sub>/tools/physics/Codes'
</li>
<li>ROMS  : '/media/demiurgo/TOSHIBA EXT/Data<sub>fisica</sub><sub>AJF</sub>/ROMS/avg/**YEAR**'/Parent files
</li>
<li>outputs:
<ul>
<li>.mat files : '<i>home/demiurgo/Documents/2015/Oceanography/physics/output/**YEAR**'/'   - .nc files  : '/home/demiurgo/Documents/2015/Oceanography/physics/output/Netcdf<sub>out</sub></i>'
</li>
</ul>

</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-4-3-2-2-2">Getting the polygos<br/>
<ul>
<li>It is necesary to call the BMG file to obtatin the information of the polygons, to do this I use the function 'read.boxes'
</li>
<li>To calculate the transpors its necesary to know the faces of the polygos, for that I use the read<sub>faces2</sub> function
</li>
<li>Its  Necesary to define the layer depth, in my case and based on Biology and Oceanography I select 8 levels
</li>
</ul>

<ul>
<li id="sec-4-3-2-2-2-1">Code In matlab<br/>



<pre class="src src-matlab">BGM_JFR_ll = <span style="color: #ffc125; font-weight: bold;">'/home/demiurgo/Documents/2015/Oceanography/physics/BMG_files/JFRE_ll.bgm'</span>;
[nbox,nface,bid,cent,b_area,verts,iface, botz] = read_boxes(BGM_JFR_ll);
[nulr,nupt1,nupt2] = read_faces2(nbox, nface, bid,verts, iface, BGM_JFR_ll);


iface      = iface;  <span style="color: #696969;">%% Id of the faces</span>
lr         = nulr;   <span style="color: #696969;">%% Neightbourn Layers</span>
pt1        = nupt1;  <span style="color: #696969;">%% Face 1</span>
pt2        = nupt2;  <span style="color: #696969;">%% Face 2</span>
irealfaces = find(<span style="color: #fffacd; font-weight: bold;">~</span>isnan(nupt1(<span style="color: #fffacd; font-weight: bold;">:</span>,1)));  <span style="color: #696969;">% (ie those ref'd in box definitions)</span>
fcid       = (irealfaces<span style="color: #fffacd; font-weight: bold;">-</span>1);
rimn       = 10;     <span style="color: #696969;">% default 3 is probably too few</span>
dinc       = 1;      <span style="color: #696969;">%% 0.1;   % default 10km is probably ok, esp for large boxes</span>
                      <span style="color: #696969;">% May want to reduce the face integration step 'dinc' for models with</span>
                      <span style="color: #696969;">% small or narrow boxes.</span>
dlev = [0 20 50 150  250 400 650 1000 4300]; <span style="color: #696969;">%% This structure is related with</span>
                                             <span style="color: #696969;">% the biology and with the</span>
                                             <span style="color: #696969;">% maximum deph in the BMG model</span>
</pre>


</li>
</ul>
<ul>
<li id="sec-4-3-2-2-2-2">Functions<br/>
<ul>
<li>read<sub>boxes</sub>()
</li>
<li>read<sub>faces2</sub>()
</li>
<li>transport<sub>JFRE</sub>()
<ul>
<li>netcdf()      # NETCDF library
</li>
<li>sigma2zeta()  # Depth at sigma layer based in the maximum depth
</li>
<li>cart2pol()    # cartesian to polar (cilindrical) coordinates
</li>
<li>cosd()        # cosine in degree
</li>
<li>av2()         # grid average
</li>
<li>rot2d()       # Rotate vectors by geometrics angle
</li>
<li>Generic functions from matlab
</li>
</ul>

</li>
<li>write<sub>trans</sub><sub>file</sub>()
</li>
<li>box<sub>av</sub><sub>JFRE</sub>
<ul>
<li>netcdf()
</li>
<li>sigma2zeta()
</li>
</ul>

</li>
<li>write<sub>av</sub><sub>var</sub>()
</li>
</ul>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-4-3-2-2-3">Getting the transport<br/>
<ul>
<li>I transform the transport in sigma layers to the depth layer in the JFRE polygons
</li>
<li>I devided the transport by years
</li>
<li>The function transport<sub>JFRE</sub> it a bit hardcoded
</li>
<li>The output ist a netcd file
</li>
</ul>

<ul>
<li id="sec-4-3-2-2-3-1">Code<br/>
