MandM/Methods.org
****** Code
#+begin_src matlab
%% Running the model - saving by years %%
%% Transport between layers
for year = 2000 : 2008
    direc = (['/media/demiurgo/TOSHIBA EXT/Data_fisica_AJF/ROMS/avg/', num2str(year), '/']);
    files = dir([direc, 'nest_avg_parent.*']);
    guard = (['/home/demiurgo/Documents/2015/Oceanography/physics/output/Netcdf_out/JFRE_Transport', num2str(year), '.nc']);
    cd (['/home/demiurgo/Documents/2015/Oceanography/physics/output/', num2str(year),'/']);
    for nfile = 1 : length(files)
        fnm         = [direc, files(nfile).name];
        [T, nctime] = transport_JFRE(verts, pt1, pt2, dlev, dinc, rimn, nfile, year, fnm);
    end
    t_files = dir('*third_Step.mat');
    for f = 1 : length(t_files)
        load(t_files(f).name)
        if f == 1
            Tfinal = T;
            nctime = tims;
        else
            Tfinal = cat(2, Tfinal, T);
            nctime = cat(1, nctime, tims);
        end
    end
    save('Tfinal.mat', 'Tfinal', 'nctime');
    % writing the NETCDF file
    write_trans_file(pt1, pt2, lr, nctime, Tfinal, fcid, guard)
end

#+end_#+begin_src language

#+end_src

***** Getting variables
- To variables stracted are the mean by layer and by polygons
- the variables were saved by year
- The output ist a netcd file
****** Code
 - Base code

#+begin_src matlab
varn = {'temp';  'salt';  'w';  'CHLA';   'NO3'}
for v  =  1 : length(varn)
    for year = 2000 : 2008
        avname  = char(varn(v));
        direc = (['/media/demiurgo/TOSHIBA EXT/Data_fisica_AJF/ROMS/avg/', num2str(year), '/']);
        files = dir([direc, 'nest_avg_parent.*']);
        guard = (['/home/demiurgo/Documents/2015/Oceanography/physics/output/Netcdf_out/JFRE_', num2str(year), avname, '.nc'])
        cd (['/home/demiurgo/Documents/2015/Oceanography/physics/output/', num2str(year),'/'])
        for nfile = 1 : length(files)
            fnm   = [direc, files(nfile).name];
            box_av_JFRE(verts, avname, dlev, nfile, year,  fnm)
        end
        t_files = dir(['*', avname, '_JFRE.mat']);
        for f = 1 : length(t_files)
            load(t_files(f).name)
            if f == 1
                Av_final = Var_avg;
                nctime   = tims;
            else
                Av_final = cat(2, Av_final, Var_avg);
                nctime   = cat(1, nctime, tims);
            end
        end
        file.save = ([num2str(year), '_Av_', avname, '.mat'])
        save(file.save, 'Av_final', 'nctime')
        % writing the NETCDF file
        write_av_var(nctime, bid, avname, Av_final, guard)
    end
end
#+end_#+begin_src language

#+end_src

** Using Hydrocontruct
*** Getting the code
- svn co https://svnserv.csiro.au/svn/atlantis/HydroConstruct
**** Installing Hydro under ubuntu
  - nescesary dev files for ubuntu
    - sudo apt-get install libcunit1-dev
  - autotools for build and compile
    - aclocal
    - autoheader
    - autoconf
    - automake -a
    - ./configure
    - make
    - sudo make install

**** running hydrocontruct
