MandM/Methods.html



<pre class="src src-matlab"><span style="color: #696969; font-weight: bold; text-decoration: overline;">%% Running the model - saving by years %%</span>
<span style="color: #696969; font-weight: bold; text-decoration: overline;">%% Transport between layers</span>
<span style="color: #ff7f00; font-weight: bold;">for</span> <span style="color: #eedd82;">year</span> = <span style="color: #ff4500; font-weight: bold;">2000 : 2008</span>
    direc = ([<span style="color: #ffc125; font-weight: bold;">'/media/demiurgo/TOSHIBA EXT/Data_fisica_AJF/ROMS/avg/'</span>, num2str(year), <span style="color: #ffc125; font-weight: bold;">'/'</span>]);
    files = dir([direc, <span style="color: #ffc125; font-weight: bold;">'nest_avg_parent.*'</span>]);
    guard = ([<span style="color: #ffc125; font-weight: bold;">'/home/demiurgo/Documents/2015/Oceanography/physics/output/Netcdf_out/JFRE_Transport'</span>, num2str(year), <span style="color: #ffc125; font-weight: bold;">'.nc'</span>]);
    cd ([<span style="color: #ffc125; font-weight: bold;">'/home/demiurgo/Documents/2015/Oceanography/physics/output/'</span>, num2str(year),<span style="color: #ffc125; font-weight: bold;">'/'</span>]);
    <span style="color: #ff7f00; font-weight: bold;">for</span> <span style="color: #eedd82;">nfile</span> = <span style="color: #ff4500; font-weight: bold;">1 : length(files)</span>
        fnm         = [direc, files(nfile).name];
        [T, nctime] = transport_JFRE(verts, pt1, pt2, dlev, dinc, rimn, nfile, year, fnm);
    <span style="color: #ff7f00; font-weight: bold;">end</span>
    t_files = dir(<span style="color: #ffc125; font-weight: bold;">'*third_Step.mat'</span>);
    <span style="color: #ff7f00; font-weight: bold;">for</span> <span style="color: #eedd82;">f</span> = <span style="color: #ff4500; font-weight: bold;">1 : length(t_files)</span>
        load(t_files(f).name)
        <span style="color: #ff7f00; font-weight: bold;">if</span> f <span style="color: #fffacd; font-weight: bold;">==</span> 1
            Tfinal = T;
            nctime = tims;
        <span style="color: #ff7f00; font-weight: bold;">else</span>
            Tfinal = cat(2, Tfinal, T);
            nctime = cat(1, nctime, tims);
        <span style="color: #ff7f00; font-weight: bold;">end</span>
    <span style="color: #ff7f00; font-weight: bold;">end</span>
    save(<span style="color: #ffc125; font-weight: bold;">'Tfinal.mat'</span>, <span style="color: #ffc125; font-weight: bold;">'Tfinal'</span>, <span style="color: #ffc125; font-weight: bold;">'nctime'</span>);
    <span style="color: #696969;">% writing the NETCDF file</span>
    write_trans_file(pt1, pt2, lr, nctime, Tfinal, fcid, guard)
<span style="color: #ff7f00; font-weight: bold;">end</span>

#<span style="color: #fffacd; font-weight: bold;">+</span>end_#<span style="color: #fffacd; font-weight: bold;">+</span>begin_src language

</pre>


</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-4-3-2-2-4">Getting variables<br/>
<ul>
<li>To variables stracted are the mean by layer and by polygons
</li>
<li>the variables were saved by year
</li>
<li>The output ist a netcd file
</li>
</ul>

<ul>
<li id="sec-4-3-2-2-4-1">Code<br/>
<ul>
<li>Base code
</li>
</ul>





<pre class="src src-matlab">varn = {<span style="color: #ffc125; font-weight: bold;">'temp'</span>;  <span style="color: #ffc125; font-weight: bold;">'salt'</span>;  <span style="color: #ffc125; font-weight: bold;">'w'</span>;  <span style="color: #ffc125; font-weight: bold;">'CHLA'</span>;   <span style="color: #ffc125; font-weight: bold;">'NO3'</span>}
<span style="color: #ff7f00; font-weight: bold;">for</span> <span style="color: #eedd82;">v</span>  =  <span style="color: #ff4500; font-weight: bold;">1 : length(varn)</span>
    <span style="color: #ff7f00; font-weight: bold;">for</span> <span style="color: #eedd82;">year</span> = <span style="color: #ff4500; font-weight: bold;">2000 : 2008</span>
        avname  = char(varn(v));
        direc = ([<span style="color: #ffc125; font-weight: bold;">'/media/demiurgo/TOSHIBA EXT/Data_fisica_AJF/ROMS/avg/'</span>, num2str(year), <span style="color: #ffc125; font-weight: bold;">'/'</span>]);
        files = dir([direc, <span style="color: #ffc125; font-weight: bold;">'nest_avg_parent.*'</span>]);
        guard = ([<span style="color: #ffc125; font-weight: bold;">'/home/demiurgo/Documents/2015/Oceanography/physics/output/Netcdf_out/JFRE_'</span>, num2str(year), avname, <span style="color: #ffc125; font-weight: bold;">'.nc'</span>])
        cd ([<span style="color: #ffc125; font-weight: bold;">'/home/demiurgo/Documents/2015/Oceanography/physics/output/'</span>, num2str(year),<span style="color: #ffc125; font-weight: bold;">'/'</span>])
        <span style="color: #ff7f00; font-weight: bold;">for</span> <span style="color: #eedd82;">nfile</span> = <span style="color: #ff4500; font-weight: bold;">1 : length(files)</span>
            fnm   = [direc, files(nfile).name];
            box_av_JFRE(verts, avname, dlev, nfile, year,  fnm)
        <span style="color: #ff7f00; font-weight: bold;">end</span>
        t_files = dir([<span style="color: #ffc125; font-weight: bold;">'*'</span>, avname, <span style="color: #ffc125; font-weight: bold;">'_JFRE.mat'</span>]);
        <span style="color: #ff7f00; font-weight: bold;">for</span> <span style="color: #eedd82;">f</span> = <span style="color: #ff4500; font-weight: bold;">1 : length(t_files)</span>
            load(t_files(f).name)
            <span style="color: #ff7f00; font-weight: bold;">if</span> f <span style="color: #fffacd; font-weight: bold;">==</span> 1
                Av_final = Var_avg;
                nctime   = tims;
            <span style="color: #ff7f00; font-weight: bold;">else</span>
                Av_final = cat(2, Av_final, Var_avg);
                nctime   = cat(1, nctime, tims);
            <span style="color: #ff7f00; font-weight: bold;">end</span>
        <span style="color: #ff7f00; font-weight: bold;">end</span>
        file.save = ([num2str(year), <span style="color: #ffc125; font-weight: bold;">'_Av_'</span>, avname, <span style="color: #ffc125; font-weight: bold;">'.mat'</span>])
        save(file.save, <span style="color: #ffc125; font-weight: bold;">'Av_final'</span>, <span style="color: #ffc125; font-weight: bold;">'nctime'</span>)
        <span style="color: #696969;">% writing the NETCDF file</span>
        write_av_var(nctime, bid, avname, Av_final, guard)
    <span style="color: #ff7f00; font-weight: bold;">end</span>
<span style="color: #ff7f00; font-weight: bold;">end</span>
#<span style="color: #fffacd; font-weight: bold;">+</span>end_#<span style="color: #fffacd; font-weight: bold;">+</span>begin_src language

</pre>


</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Using Hydrocontruct</h3>
<div class="outline-text-3" id="text-4-4">


</div>

<div id="outline-container-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> Getting the code</h4>
<div class="outline-text-4" id="text-4-4-1">

<ul>
<li>svn co <a href="https://svnserv.csiro.au/svn/atlantis/HydroConstruct">https://svnserv.csiro.au/svn/atlantis/HydroConstruct</a>
</li>
</ul>

<ul>
<li id="sec-4-4-1-1">Installing Hydro under ubuntu<br/>
<ul>
<li>nescesary dev files for ubuntu
<ul>
<li>sudo apt-get install libcunit1-dev
</li>
</ul>

</li>
<li>autotools for build and compile
<ul>
<li>aclocal
</li>
<li>autoheader
</li>
<li>autoconf
</li>
<li>automake -a
</li>
<li>./configure
</li>
<li>make
</li>
<li>sudo make install
</li>
</ul>

</li>
</ul>


</li>
</ul>
<ul>
<li id="sec-4-4-1-2">running hydrocontruct<br/>
<ul>
