MandM/Methods.html
<li id="sec-4-4-1-2-1">Setting hydrocontruct<br/>
<ul>
<li>For this you need to use the .prm, this file contain all the settings
</li>
<li>be careful to use the layer thikness and not the comulative depth
</li>
</ul>




<pre class="src src-dat"># Message level setting: 0 = no messages, 1 = step-by-step
# reporting on program progress
verbose 0

# read back exchanges per box
verbose_exchange 0

verbose_box 0

# read back dates used to pad out the timeseries
verbose_pad 0

## General characteristics for flows
# use unidirectional flows (so negative flow from A to B recast as positive flow from B to A)
# either setting ok if flows reporting as net flow across faces, but if have gross flows set to 0
unidirectional_flow 0

# rewind file between reading lines (0=no which is faster, 1=yes which is safer)
rewind 1

# Generic code used (1) or hardwired read in (0)
generic 1

# Geometry file being used by boxmodel
geofile JFRE_xy.bgm

# File with lat-long coordinates of the faces in it - only really needed if using netcdf input data
llgeofile JFRE_ll.bgm

# Recycle flows through time
recycle_flow 0

# Slow diffusion (0 flows replaced by 0.0000001 flows) allowed (0=no, 1=yes)
slow_diffusion 0

# Assumed vertical diffusion allowed (0=no, 1=yes)
vert_diffusion 0

# Assumed (minimal) back diffusion allowed (0=no, 1=yes)
back_diffusion 0

# Reference year - exchanges etc are referenced from 07-01-2000 (MM-DD HH:MM:SS) of this year
reference_year 2000

# Start time of output file (days) starts on the 07-Jan-2000 11:48:16
tstart 0

# End time of output file (days) ends on the 30-Dec-2008 12:22:24
tstop 656

# Time step of the output file (seconds) &lt;=&gt; 5 days
dt 432000

# Reset time so start at time zero rather than t = .... in file
reset_time 1

# Total (maxiumum) number of water column layers
wcnz 8

# Default water column layer thickness
default_layer_dz 8
20 30 100 100 150 250 350 3300


# Number of water column layers per box
numlayers 41
8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 6 6 6 6 6 6 6 4 4 4 4 8 8 4 4 4 4 0 6 6 0 6 5

# Boundary flag and boundary type (0 = non-boundary, 1 = normal boundary, 2 = absorptive, 3 = reflective)
boundaries 41
1 0 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 1 0 0


# In addition to any scaling below, flows are area corrected to try and avoid hyperdiffusion (0 = no, 1 = yes, 2 = yes, with respect to the shape of the box)
area_correct_flow 1
area_correct_vflow 0

# Scaling of flow per box (e.g. -1.0 to reverse flows)
box_scaling 41
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1

## Horizontal flow information
# Number of destination cells
ndest 100

# Missing data value (flows &lt; than -(this value) will be ignored)
missing_data -9999999999

# Number of data entries per line
n_inline 1

# Data type (0 = Al Herman NOAA format, 1 = CSIRO flat format, 2 = CSIRO netcdf format)
input_type 2

# Units for flow data (0 = Sverdrups, 1 = m3/s)
unit_type 1

# Number output files
numoutfile 1

## Hydrodynamic files
nhdfiles 1
trans0.name JFRE_Transport.nc

# Number of faces representing estuaries where need to <span style="color: #ffc125; font-weight: bold;">"by hand"</span> specify flows
num_estuaries 0

# Estuarine face ids (face numbers in geofile that define estuary mouth) - must have as many entries as specified by num_estuaries
# or at least 1 entry, which ever is smaller
river_ids 1
0

# Estuarine fluxes - must have as many entries as specified by num_estuaries
# or at least 1 entry, which ever is smaller. Rates must be in the same units as in the raw data files
river_influxes 1
0
river_outfluxes 1
0

## Vertical exchange files
nvhdfiles 0
vtrans0.name JFRE_2000v.nc

## Temperature and Salinity file information
# Temperature missing data values (temperatures &lt; than -(this value) will be ignored)
temp_missing_data 1

# Salinity missing data values (salinities &lt; than -(this value) will be ignored)
salt_missing_data 1

# Flag indicating whether absolute values or fluxes of temperature and salinity used
# (0 = absolute values, 1 = fluxes added to init values, 2 = fluxes summed)
tsflagflux 0

# Temperature and salinity profile files
ntsfiles 1
tempsalt0.name JFRE_Variables.nc

pad_time 0
ph_missing_data 0

</pre>

</li>
</ul>
<ul>
<li id="sec-4-4-1-2-2">running hydrocontruc<br/>



<pre class="src src-BASH">#!/bin/bash
sudo make install -C /home/demiurgo/Documents/2015/Oceanography/physics/Codes/Contruct/HydroConstruct/trunk/
if [ $? -eq 0 ] ; then
    #valgrind --leak-check=full --log-file=Valgrind.%p --show-reachable=yes
    #gdb --args
    HydroConstruct -f flowout.cdf -t tempout.cdf -s saltout.cdf -r parameters.prm

    mkdir Salida_Atlantis
    mv saltout.cdf  Salida_Atlantis
    mv tempout.cdf  Salida_Atlantis
    mv flowout.cdf  Salida_Atlantis/flowout.cdf
    mv volume1.cdf  Salida_Atlantis/volume.cdf

    cd  Salida_Atlantis
    ncgen -o JFRE_temp.nc tempout.cdf
    ncgen -o JFRE_salt.nc saltout.cdf
    ncgen -o JFRE_hydro.nc flowout.cdf

    cd ..


else
    echo 'Failed to compile hydro construct'

fi
</pre>


</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> physics parameter file</h3>
<div class="outline-text-3" id="text-4-5">


</div>

<div id="outline-container-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> Settings</h4>
<div class="outline-text-4" id="text-4-5-1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Parameter</th><th scope="col" class="left">Original Value</th><th scope="col" class="left">Atlatnis value</th><th scope="col" class="left">Reference</th><th scope="col" class="left">Comment</th></tr>
</thead>
<tbody>
<tr><td class="left">All for SEdiment</td><td class="left">Atlantis default</td><td class="left">Atlantids defaul</td><td class="left">Beth</td><td class="left">I kept the same values. I will calibrate the ecology first</td></tr>
<tr><td class="left">eddy<sub>seasons</sub></td><td class="left">1</td><td class="left">Use calculated values</td><td class="left">oceano.tools</td><td class="left">It important to check the same result than andrade, for the spring increase of cholrofila</td></tr>
<tr><td class="left">eddy<sub>vertmix</sub></td><td class="left">0</td><td class="left">0</td><td class="left">Beth</td><td class="left">It is necesary to change to 1 to represnet the effect of the eddies</td></tr>
<tr><td class="left">other parameter</td><td class="left">No-variation</td><td class="left">Same than atlantis</td><td class="left"></td><td class="left"></td></tr>
</tbody>
</table>


</div>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Setting Atlantis</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> CSV files</h3>
<div class="outline-text-3" id="text-5-1">


</div>

<div id="outline-container-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> SETasfishery</h4>
<div class="outline-text-4" id="text-5-1-1">

<ul>
<li id="sec-5-1-1-1">It is necesary put the bycatch species in the model as a fisheries?<br/>
</li>
</ul>
<ul>
<li id="sec-5-1-1-2">First table<br/>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="left" /><col class="right" /><col class="right" />
</colgroup>
<thead>
