MandM/Methods.org
**** First table
| Code     | Index | Name                            | IsRec | NumSubFleets |
|----------+-------+---------------------------------+-------+--------------|
| trapSPL  |     1 | trap spiny lobster              |     0 |            0 |
| trapGCR  |     2 | trap golden crab                |     0 |            0 |
| llBRC    |     3 | long line breca                 |     0 |            0 |
| trawORO  |     4 | trwal orange roughy             |     0 |            0 |
| trawALF  |     5 | trawl alfonsino                 |     0 |            0 |
| llLPF    |     6 | long line large pelagic fish    |     0 |            0 |
| hlineLPF |     7 | hand line Large pelagic fish    |     0 |            0 |
| recLPF   |     8 | recreational large pelagic fish |     1 |            0 | # Mainly tunna and vidriola with spear
| hlineSPF |     9 | hand line small pelagic fish    |     0 |            0 |
| llSBF    |    10 | long line small benthic fish    |     0 |            0 |
| trapLBF  |    11 | Trap large benthic fish         |     0 |            0 |
| llLBF    |    12 | Trap large benthic fish         |     0 |            0 |

*** SETasGroups
