MandM/Methods.html
<tr><th scope="col" class="left">Code</th><th scope="col" class="right">Index</th><th scope="col" class="left">Name</th><th scope="col" class="right">IsRec</th><th scope="col" class="right">NumSubFleets</th></tr>
</thead>
<tbody>
<tr><td class="left">trapSPL</td><td class="right">1</td><td class="left">trap spiny lobster</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">trapGCR</td><td class="right">2</td><td class="left">trap golden crab</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">llBRC</td><td class="right">3</td><td class="left">long line breca</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">trawORO</td><td class="right">4</td><td class="left">trwal orange roughy</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">trawALF</td><td class="right">5</td><td class="left">trawl alfonsino</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">llLPF</td><td class="right">6</td><td class="left">long line large pelagic fish</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">hlineLPF</td><td class="right">7</td><td class="left">hand line Large pelagic fish</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">recLPF</td><td class="right">8</td><td class="left">recreational large pelagic fish</td><td class="right">1</td><td class="right">0</td><td class="left"># Mainly tunna and vidriola with spear</td></tr>
<tr><td class="left">hlineSPF</td><td class="right">9</td><td class="left">hand line small pelagic fish</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">llSBF</td><td class="right">10</td><td class="left">long line small benthic fish</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">trapLBF</td><td class="right">11</td><td class="left">Trap large benthic fish</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">llLBF</td><td class="right">12</td><td class="left">Trap large benthic fish</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
</table>


</li>
</ul>
</div>

</div>
