MandM/Methods.html

<div id="outline-container-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> SETasGroups</h4>
<div class="outline-text-4" id="text-5-1-2">

<ul>
<li id="sec-5-1-2-1">It is possible to have an workshop of one day with beth<br/>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="right" /><col class="left" /><col class="left" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="left" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Code</th><th scope="col" class="right">Index</th><th scope="col" class="right">IsTurnedOn</th><th scope="col" class="left">Name</th><th scope="col" class="left">Long Name</th><th scope="col" class="right">NumCohorts</th><th scope="col" class="right">NumGeneTypes</th><th scope="col" class="right">NumStages</th><th scope="col" class="right">NumSpawns</th><th scope="col" class="right">NumAgeClassSize</th><th scope="col" class="right">NumStocks</th><th scope="col" class="right">MovesVertically</th><th scope="col" class="right">MovesHorizontally</th><th scope="col" class="right">isFished</th><th scope="col" class="right">IsImpacted</th><th scope="col" class="right">isTAC</th><th scope="col" class="left">GroupType</th><th scope="col" class="right">isPredator</th><th scope="col" class="right">IsCover</th><th scope="col" class="right">isSiliconDep</th><th scope="col" class="right">isAssessed</th><th scope="col" class="right">IsCatchGrazer</th><th scope="col" class="right">isOverWinter</th><th scope="col" class="right">isCultured</th><th scope="col" class="right">isHabDepend</th></tr>
</thead>
<tbody>
<tr><td class="left">SPL</td><td class="right">0</td><td class="right">1</td><td class="left">Spiny<sub>lobster</sub></td><td class="left">Spiny lobster</td><td class="right">1</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">2</td><td class="right">0</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="left">FISH<sub>INVERT</sub></td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">GCR</td><td class="right">1</td><td class="right">1</td><td class="left">Golden<sub>Crab</sub></td><td class="left">Golden Crab</td><td class="right">1</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">2</td><td class="right">0</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="left">FISH<sub>INVERT</sub></td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">BRC</td><td class="right">2</td><td class="right">1</td><td class="left">Breca</td><td class="left">Breca</td><td class="right">10</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="left">FISH</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">VID</td><td class="right">3</td><td class="right">1</td><td class="left">Vidriola</td><td class="left">Vidriola</td><td class="right">3</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="left">FISH</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">ORO</td><td class="right">4</td><td class="right">1</td><td class="left">Orange<sub>Roughy</sub></td><td class="left">Orange Roughy</td><td class="right">1</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="left">FISH</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">ALF</td><td class="right">5</td><td class="right">1</td><td class="left">Alfonsino</td><td class="left">Alfonsino</td><td class="right">1</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="left">FISH</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">ANG</td><td class="right">6</td><td class="right">1</td><td class="left">Anguila</td><td class="left">Anguila</td><td class="right">1</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">3</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="left">FISH</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">CHO</td><td class="right">7</td><td class="right">1</td><td class="left">Chondrichtyans</td><td class="left">Chondrichtyans</td><td class="right">1</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="left">SHARK</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">OTA</td><td class="right">8</td><td class="right">1</td><td class="left">Otariid</td><td class="left">Otariid</td><td class="right">1</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="left">MAMMAL</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">CET</td><td class="right">9</td><td class="right">1</td><td class="left">Cetaceans</td><td class="left">Cetaceans</td><td class="right">1</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">MAMMAL</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">BIR</td><td class="right">10</td><td class="right">1</td><td class="left">Birds</td><td class="left">Birds</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">BIRD</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">OCT</td><td class="right">11</td><td class="right">1</td><td class="left">Octupus</td><td class="left">Octupus</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="left">CEP</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">LPF</td><td class="right">12</td><td class="right">1</td><td class="left">Pelagic<sub>L</sub><sub>fish</sub></td><td class="left">Large pelagic fish</td><td class="right">5</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="left">FISH</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">SPF</td><td class="right">13</td><td class="right">1</td><td class="left">Pelagic<sub>S</sub><sub>fish</sub></td><td class="left">Small pelagic fish</td><td class="right">6</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="left">FISH</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">SBF</td><td class="right">14</td><td class="right">1</td><td class="left">Benthic<sub>S</sub><sub>fish</sub></td><td class="left">Small benthic fish</td><td class="right">10</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="left">FISH</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">LBF</td><td class="right">15</td><td class="right">1</td><td class="left">Benthic<sub>L</sub><sub>fish</sub></td><td class="left">Large benthic fish</td><td class="right">10</td><td class="right">1</td><td class="right">2</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="left">FISH</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">SZO</td><td class="right">16</td><td class="right">1</td><td class="left">Small<sub>zooplankton</sub></td><td class="left">Small Zooplankton</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">MED<sub>ZOO</sub></td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">MZO</td><td class="right">17</td><td class="right">1</td><td class="left">Med<sub>zooplankton</sub></td><td class="left">Medium Zooplankton</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">MED<sub>ZOO</sub></td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">LZO</td><td class="right">18</td><td class="right">1</td><td class="left">Large<sub>zooplankton</sub></td><td class="left">Large Zooplankton</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">LG<sub>ZOO</sub></td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">SCR</td><td class="right">19</td><td class="right">1</td><td class="left">Small<sub>crus</sub></td><td class="left">Small crustaceans</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="left">MOB<sub>EP</sub><sub>OTHER</sub></td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">BFF</td><td class="right">20</td><td class="right">1</td><td class="left">Deposit<sub>feeders</sub></td><td class="left">Deposit feeders</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="left">LG<sub>INF</sub></td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">LPH</td><td class="right">21</td><td class="right">1</td><td class="left">Large<sub>phyto</sub></td><td class="left">Large phytoplankton</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">LG<sub>PHY</sub></td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">SPH</td><td class="right">22</td><td class="right">1</td><td class="left">Small<sub>phyto</sub></td><td class="left">Small phytoplankton</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">SM<sub>PHY</sub></td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">SUR</td><td class="right">23</td><td class="right">1</td><td class="left">Sea<sub>urchins</sub></td><td class="left">Sea urchins</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">SED<sub>EP</sub><sub>FF</sub></td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">MOL</td><td class="right">24</td><td class="right">1</td><td class="left">Mollusca</td><td class="left">Mollusca</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">SED<sub>EP</sub><sub>FF</sub></td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">NO</td><td class="right">25</td><td class="right">1</td><td class="left">Nitrate</td><td class="left">Nitrate</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">NIT</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">MA</td><td class="right">26</td><td class="right">1</td><td class="left">Macroalgae</td><td class="left">Macroalgae</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">PHYTOBEN</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">PB</td><td class="right">27</td><td class="right">1</td><td class="left">Pelag<sub>Bact</sub></td><td class="left">Pelagic Bacteria</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">PL<sub>BACT</sub></td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">BB</td><td class="right">28</td><td class="right">1</td><td class="left">Sed<sub>Bact</sub></td><td class="left">Sediment Bacteria</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">SED<sub>BACT</sub></td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">DL</td><td class="right">29</td><td class="right">1</td><td class="left">Labile<sub>detritus</sub></td><td class="left">Labile detritus</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">LAB<sub>DET</sub></td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">DR</td><td class="right">30</td><td class="right">1</td><td class="left">Refractory<sub>detritrus</sub></td><td class="left">Refractory detritrus</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">REF<sub>DET</sub></td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">DC</td><td class="right">31</td><td class="right">1</td><td class="left">Carrion</td><td class="left">Carrion</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">CARRION</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
</table>


</li>
</ul>
<ul>
