MandM/Methods.org
**** Information functional groups
***** Growth and Age
****** Orange Roughy
- Male
| Source      | N-sample | Age Range | length type |  Linf |      K |     to |
|-------------+----------+-----------+-------------+-------+--------+--------|
| FIP 2000-12 |     1516 |           | Fork        | 47.86 | 0.0374 | -1.414 |
|             |     1516 |           | Standar     | 43.68 | 0.0372 | -1.639 |

- Female

| Source      | N-sample | Age Range | length type | Linf |      K |     to |
|-------------+----------+-----------+-------------+------+--------+--------|
| FIP 2000-12 |     1554 |           | Fork        | 53.8 | 0.0304 | -1.691 |
|             |     1554 |           | Standar     |   49 | 0.0303 | -1.973 |

- Both sex

| Source      | N-sample | Age Range | length type |  Linf |      K |     to |
|-------------+----------+-----------+-------------+-------+--------+--------|
| FIP 2000-12 |     1890 |           | Fork        | 52.13 | 0.0313 | -1.716 |
|             |     1890 |           | Standar     | 47.51 | 0.0303 |     -2 |

****** Alfosino
- Male
| Source      | N-sample | Age Range | length type |  Linf |      K |     to |
|-------------+----------+-----------+-------------+-------+--------+--------|
| FIP 2000-12 |      671 |      1-15 | Fork        | 58.54 |  0.106 | -2.393 |


- Female

| Source      | N-sample | Age Range | length type |  Linf |      K |     to |
|-------------+----------+-----------+-------------+-------+--------+--------|
| FIP 2000-12 |      706 |      1-19 | Fork        | 63.59 |  0.095 | -2.458 |


- Both sex

| Source      | N-sample | Age Range | length type |  Linf |      K |     to |
|-------------+----------+-----------+-------------+-------+--------+--------|
| FIP 2000-12 |     1377 |      1-19 | Fork        | 63.39 | 0.0928 | -2.567 |

***** Growth-Weight
****** Orange Roughy
- Male
| Source      | N-sample |   Winf |      K |     to |
|-------------+----------+--------+--------+--------|
| FIP 2000-12 |     1516 | 3180.6 | 0.0130 | 1.745  |


- Female

| Source      | N-sample |   Winf |      K |    to |
|-------------+----------+--------+--------+-------|
| FIP 2000-12 |     1554 | 4989.9 | 0.0091 | 1.925 |


- Both sex

| Source      | N-sample |   Linf |     K |    to |
|-------------+----------+--------+-------+-------|
| FIP 2000-12 |     1890 | 4956.9 | 0.008 | 2.064 |

***** Natural mortality (M)
****** Orange Roughy

| Source      | Sex    | Value |
|-------------+--------+-------|
| FIP 2000-12 | Male   | 0.053 |
|             | Female | 0.047 |

****** Alfonsino

| Source      | Sex    | Value |
|-------------+--------+-------|
| FIP 2000-12 | Male   | 0.162 |
|             | Female | 0.152 |

***** It is posbible to recontructs the age of alfonsino and orange
** PRM files
*** Biology input file
