MandM/Methods.html
<li id="sec-5-1-2-2">Information functional groups<br/>
<ul>
<li id="sec-5-1-2-2-1">Growth and Age<br/>
<ul>
<li id="sec-5-1-2-2-1-1">Orange Roughy<br/>
<ul>
<li>Male
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="left" /><col class="left" /><col class="right" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Source</th><th scope="col" class="right">N-sample</th><th scope="col" class="left">Age Range</th><th scope="col" class="left">length type</th><th scope="col" class="right">Linf</th><th scope="col" class="right">K</th><th scope="col" class="right">to</th></tr>
</thead>
<tbody>
<tr><td class="left">FIP 2000-12</td><td class="right">1516</td><td class="left"></td><td class="left">Fork</td><td class="right">47.86</td><td class="right">0.0374</td><td class="right">-1.414</td></tr>
<tr><td class="left"></td><td class="right">1516</td><td class="left"></td><td class="left">Standar</td><td class="right">43.68</td><td class="right">0.0372</td><td class="right">-1.639</td></tr>
</tbody>
</table>


<ul>
<li>Female
</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="left" /><col class="left" /><col class="right" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Source</th><th scope="col" class="right">N-sample</th><th scope="col" class="left">Age Range</th><th scope="col" class="left">length type</th><th scope="col" class="right">Linf</th><th scope="col" class="right">K</th><th scope="col" class="right">to</th></tr>
</thead>
<tbody>
<tr><td class="left">FIP 2000-12</td><td class="right">1554</td><td class="left"></td><td class="left">Fork</td><td class="right">53.8</td><td class="right">0.0304</td><td class="right">-1.691</td></tr>
<tr><td class="left"></td><td class="right">1554</td><td class="left"></td><td class="left">Standar</td><td class="right">49</td><td class="right">0.0303</td><td class="right">-1.973</td></tr>
</tbody>
</table>


<ul>
<li>Both sex
</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="left" /><col class="left" /><col class="right" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Source</th><th scope="col" class="right">N-sample</th><th scope="col" class="left">Age Range</th><th scope="col" class="left">length type</th><th scope="col" class="right">Linf</th><th scope="col" class="right">K</th><th scope="col" class="right">to</th></tr>
</thead>
<tbody>
<tr><td class="left">FIP 2000-12</td><td class="right">1890</td><td class="left"></td><td class="left">Fork</td><td class="right">52.13</td><td class="right">0.0313</td><td class="right">-1.716</td></tr>
<tr><td class="left"></td><td class="right">1890</td><td class="left"></td><td class="left">Standar</td><td class="right">47.51</td><td class="right">0.0303</td><td class="right">-2</td></tr>
</tbody>
</table>


</li>
</ul>
<ul>
<li id="sec-5-1-2-2-1-2">Alfosino<br/>
<ul>
<li>Male
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Source</th><th scope="col" class="left">N-sample</th><th scope="col" class="left">Age Range</th><th scope="col" class="left">length type</th><th scope="col" class="left">Linf</th><th scope="col" class="left">K</th><th scope="col" class="left">to</th></tr>
</thead>
<tbody>
<tr><td class="left">FIP 2000-12</td><td class="left">671</td><td class="left">1-15</td><td class="left">Fork</td><td class="left">58.54</td><td class="left">0.106</td><td class="left">-2.393</td></tr>
</tbody>
</table>



<ul>
<li>Female
</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Source</th><th scope="col" class="left">N-sample</th><th scope="col" class="left">Age Range</th><th scope="col" class="left">length type</th><th scope="col" class="left">Linf</th><th scope="col" class="left">K</th><th scope="col" class="left">to</th></tr>
</thead>
<tbody>
<tr><td class="left">FIP 2000-12</td><td class="left">706</td><td class="left">1-19</td><td class="left">Fork</td><td class="left">63.59</td><td class="left">0.095</td><td class="left">-2.458</td></tr>
</tbody>
</table>



<ul>
<li>Both sex
</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Source</th><th scope="col" class="left">N-sample</th><th scope="col" class="left">Age Range</th><th scope="col" class="left">length type</th><th scope="col" class="left">Linf</th><th scope="col" class="left">K</th><th scope="col" class="left">to</th></tr>
</thead>
<tbody>
<tr><td class="left">FIP 2000-12</td><td class="left">1377</td><td class="left">1-19</td><td class="left">Fork</td><td class="left">63.39</td><td class="left">0.0928</td><td class="left">-2.567</td></tr>
</tbody>
</table>


</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-5-1-2-2-2">Growth-Weight<br/>
<ul>
<li id="sec-5-1-2-2-2-1">Orange Roughy<br/>
<ul>
<li>Male
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Source</th><th scope="col" class="left">N-sample</th><th scope="col" class="left">Winf</th><th scope="col" class="left">K</th><th scope="col" class="left">to</th></tr>
</thead>
<tbody>
<tr><td class="left">FIP 2000-12</td><td class="left">1516</td><td class="left">3180.6</td><td class="left">0.0130</td><td class="left">1.745</td></tr>
</tbody>
</table>



<ul>
<li>Female
</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Source</th><th scope="col" class="left">N-sample</th><th scope="col" class="left">Winf</th><th scope="col" class="left">K</th><th scope="col" class="left">to</th></tr>
</thead>
<tbody>
<tr><td class="left">FIP 2000-12</td><td class="left">1554</td><td class="left">4989.9</td><td class="left">0.0091</td><td class="left">1.925</td></tr>
</tbody>
</table>



<ul>
<li>Both sex
</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Source</th><th scope="col" class="left">N-sample</th><th scope="col" class="left">Linf</th><th scope="col" class="left">K</th><th scope="col" class="left">to</th></tr>
</thead>
<tbody>
<tr><td class="left">FIP 2000-12</td><td class="left">1890</td><td class="left">4956.9</td><td class="left">0.008</td><td class="left">2.064</td></tr>
</tbody>
</table>


</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-5-1-2-2-3">Natural mortality (M)<br/>
<ul>
<li id="sec-5-1-2-2-3-1">Orange Roughy<br/>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Source</th><th scope="col" class="left">Sex</th><th scope="col" class="right">Value</th></tr>
</thead>
<tbody>
<tr><td class="left">FIP 2000-12</td><td class="left">Male</td><td class="right">0.053</td></tr>
<tr><td class="left"></td><td class="left">Female</td><td class="right">0.047</td></tr>
</tbody>
</table>


</li>
</ul>
<ul>
<li id="sec-5-1-2-2-3-2">Alfonsino<br/>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Source</th><th scope="col" class="left">Sex</th><th scope="col" class="right">Value</th></tr>
</thead>
<tbody>
<tr><td class="left">FIP 2000-12</td><td class="left">Male</td><td class="right">0.162</td></tr>
<tr><td class="left"></td><td class="left">Female</td><td class="right">0.152</td></tr>
</tbody>
</table>


</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-5-1-2-2-4">It is posbible to recontructs the age of alfonsino and orange<br/>
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> PRM files</h3>
<div class="outline-text-3" id="text-5-2">


</div>

<div id="outline-container-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Biology input file</h4>
<div class="outline-text-4" id="text-5-2-1">

<ul>
<li id="sec-5-2-1-1">looks for<br/>
<ul>
