MandM/Methods.org
**** looks for
- [X] Activity period (day-night)
- [-] Spatial distribution juvenile and adult (case of jurelilo-jurel)
  * [ ] for crustacean I used as division the maturity
    - 106.62 for Golden crab, based in Ernst 2013 report (it is the most conservative value)
    - 72.2 for robinson and 74.8 for selkirk are the values of maturity for lobster. I used the mean between both values 73.5
  * [X] For the division Adult and juvenile for breca Breca I use 282 mm  of Fork length Based on Rivara Thesis
  * To use the information by weight I use the mean weight in the catches
     | Functional Group | Mean weight | Reference      |
     |------------------+-------------+----------------|
     | Octopus          |         723 | Arancibia 2005 |
     | Breca            |         746 | Billy DB       |
     | Anguila          |        1013 | Billy DB       |

- [X] Effect of ph in crustacean  -  Acidification at the moment is settle to 1 (line 770)
  - There is effect on behavior in other species of crustacean
- [ ] Light penetration through the water column
  - Ask Caly abouyt this
- [X] distribution by zone [7/7]
  - [X] Orange Roughy  -  Nicklitschek 2007 (evaluacion hidroacustica alfonsino y orange
         | Zone  |  2003 |  2004 |  2005 | 2006 | Average | Zones_Atlantis |
         |-------+-------+-------+-------+------+---------+----------------|
         | JF1   |  2196 |  2019 |  9590 | 3749 |    4388 |    31,32,33,34 |
         | JF2   |  7246 |  6062 |  2847 | 2201 |    4589 |             30 |
         | JF3   |  4536 |  1905 |  1531 | 1565 |    2384 |             29 |
         | JF4   |  2981 |  1572 |  1586 |  492 |    1657 |             28 |
         | BO1   |       |   927 |  1813 |      |    1370 |             50 |
         | BO2   |       |   654 |   536 |      |     595 |             49 |
         |-------+-------+-------+-------+------+---------+----------------|
         | Total | 16959 | 13139 | 17903 | 8007 |         |                |
         |-------+-------+-------+-------+------+---------+----------------|

  - [X] Alfonsino -  Nicklitschek 2007 (evaluacion hidroacustica alfonsino y orange roughy)
      | Zone  |  2005 |  2006 | Average | Zones_atlantis |
      |-------+-------+-------+---------+----------------|
      | JF1   |  7608 | 11258 |    9433 |    31,32,33,34 |
      | JF2   | 10646 |  3112 |    6879 |             30 |
      | JF4   |   181 |   203 |     192 |             28 |
      | JF6   |       |  3352 |    3352 |             47 |
      |-------+-------+-------+---------+----------------|
      | Total | 18435 | 17925 |         |                |
      |-------+-------+-------+---------+----------------|
  - [X] Chondricties - Info take it from andrade 2007 and 2008 biodiversity of seamount (it a guestimation)
           | Zone     | N/Presence | Zones       | Reference          |
           |----------+------------+-------------+--------------------|
           | JF1      | 10         | 31,32,33,34 | Yañez et al        |
           | JF2      | 1          | 30          |                    |
           | JF3      | Presence   | 29          | Andrade et al 2008 |
           | JF4      | Presence   | 28          | Andrade et al 2008 |
           | Robinson | Presence   | 35,36,37,38 | Arana  2000        |
           | Selkirk  | Presence   | 41,42,43,44 | Arana 2000         |
  - [X] Cetaceus-Info from Aguayo et al 1998. I use the map provided in the manuscript as a proxi for the spatial location
  - [X] Table distribution functional groups
        | ZONE               | 0 |            1 | 2 | 3 | 4 |            5 | 6 | 7 | 8 | 9 |           10 | 11 | 12 | 13 | 14 | 15 |           16 | 17 |           18 |           19 | 20 | 21 |           22 |           23 |           24 |           25 |           26 |           27 |           28 |           29 |           30 |           31 |           32 |           33 |           34 |           35 |           36 |           37 |           38 |           39 | 40 |           41 |           42 |           43 |           44 |    45 | 46 |           47 | 48 |           49 |           50 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Spiny Lobster      |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Adulto             |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 | 0.0403034528 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0806069056 | 0.0738377929 |  0.070389792 | 0.0767029136 | 0.0749129289 |            0 |  0 |  0.132014371 | 0.1433215209 | 0.1509611786 | 0.1569491436 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0531965438 | 0.0641715589 | 0.0612190647 | 0.0722256419 |            0 |  0 | 0.1890284955 | 0.1727596496 |  0.196821136 | 0.1905779094 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |   0.02229249 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0198155467 |  0.055078526 | 0.0727261578 | 0.0618825223 | 0.0706299865 |            0 |  0 | 0.1702537003 | 0.1699207961 | 0.1825064159 | 0.1748938582 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 | 0.0410355774 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0364760688 | 0.0566608596 | 0.0799186964 | 0.0624403444 | 0.0692883908 |            0 |  0 | 0.1544682217 | 0.1675339439 | 0.1704708807 | 0.1617070164 |     0 |  0 |            0 |  0 |            0 |            0 |
        | Juvenil            |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1275294424 | 0.1366386883 | 0.1566790292 | 0.1311731407 |            0 |  0 | 0.0546554753 | 0.1093109506 | 0.1639664259 | 0.1200468476 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1275294424 | 0.1366386883 | 0.1566790292 | 0.1311731407 |            0 |  0 | 0.0546554753 | 0.1093109506 | 0.1639664259 | 0.1200468476 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1275294424 | 0.1366386883 | 0.1566790292 | 0.1311731407 |            0 |  0 | 0.0546554753 | 0.1093109506 | 0.1639664259 | 0.1200468476 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1275294424 | 0.1366386883 | 0.1566790292 | 0.1311731407 |            0 |  0 | 0.0546554753 | 0.1093109506 | 0.1639664259 | 0.1200468476 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | GOLDEN CRAB        |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Adulto             |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.2053267265 |            0 | 0.7946732735 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 | 0.2298358113 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.4201371827 | 0.2208811693 | 0.1291458368 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |  0.329949859 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.5030241304 |            0 | 0.1670260107 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 | 0.3293860773 |            0 |            0 |            0 |            0 |            0 |            0 |  0.156850513 | 0.2450789266 | 0.0617153297 |  0.140185146 | 0.0667840075 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | Juvenil            |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.2195121951 |            0 | 0.7804878049 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 | 0.2135693771 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.7016808701 |  0.059324827 | 0.0254249258 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 | 0.0583261326 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.8861251697 |            0 | 0.0555486977 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 | 0.2585034014 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.2925170068 | 0.1292517007 | 0.3197278912 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | BRECA              |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Adulto             |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1907245859 | 0.3285586521 | 0.2949575297 | 0.1857592324 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0951066738 | 0.3527888583 |  0.268147983 | 0.2839564848 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0372615911 | 0.1018644797 | 0.1590783314 | 0.1647957023 | 0.1344446778 |            0 |  0 | 0.1098574497 | 0.1010400289 | 0.1018911785 | 0.0897665605 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0498058587 | 0.1041395228 | 0.0938648876 | 0.1300017329 | 0.0841109145 |            0 |  0 |  0.146841411 | 0.1350555692 | 0.1361932619 | 0.1199868414 |     0 |  0 |            0 |  0 |            0 |            0 |
        | Juvenil            |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0472483521 | 0.4609743069 | 0.1499145801 |  0.171838691 | 0.1700240699 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0472483521 | 0.4609743069 | 0.1499145801 |  0.171838691 | 0.1700240699 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0472483521 | 0.4609743069 | 0.1499145801 |  0.171838691 | 0.1700240699 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0472483521 | 0.4609743069 | 0.1499145801 |  0.171838691 | 0.1700240699 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | SMALL PELAGIC FISH |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |  0.229184781 | 0.0104938087 | 0.2005816568 | 0.2102959254 |            0 |  0 | 0.0849998501 |  0.163703415 |            0 | 0.1007405631 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |  0.229184781 | 0.0104938087 | 0.2005816568 | 0.2102959254 |            0 |  0 | 0.0849998501 |  0.163703415 |            0 | 0.1007405631 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |  0.229184781 | 0.0104938087 | 0.2005816568 | 0.2102959254 |            0 |  0 | 0.0849998501 |  0.163703415 |            0 | 0.1007405631 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |  0.229184781 | 0.0104938087 | 0.2005816568 | 0.2102959254 |            0 |  0 | 0.0849998501 |  0.163703415 |            0 | 0.1007405631 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | SMALL BENTIC FISH  |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0469531948 |            0 | 0.1655100118 | 0.1197306468 | 0.1622019458 | 0.1741180975 |            0 |  0 | 0.0559295409 | 0.0950802196 | 0.1100465504 | 0.0704297923 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 | 0.0363512893 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.2998981365 | 0.0636147562 | 0.1344997703 | 0.1006651088 |            0 |  0 | 0.1246329918 | 0.0894800967 | 0.0872430943 | 0.0636147562 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0808854832 | 0.5065985526 | 0.2103022563 |  0.202213708 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.2126778069 | 0.1114026608 | 0.1933434608 | 0.1291258114 |            0 |  0 | 0.0850711228 | 0.1012751462 | 0.0860838742 | 0.0810201169 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | LARGE BENTIC FISH  |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0854092527 | 0.0854092527 |  0.256227758 | 0.1921708185 |            0 |  0 | 0.1814946619 | 0.0854092527 | 0.1138790036 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0454545455 | 0.1363636364 | 0.0454545455 |            0 |            0 |  0 | 0.6363636364 | 0.0454545455 | 0.0909090909 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1824871229 | 0.1133186166 | 0.5099337748 | 0.0971302428 | 0.0971302428 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0728859907 | 0.1457719815 | 0.1665965503 | 0.2267564156 |            0 |  0 | 0.0647875473 | 0.0890828776 | 0.0883466554 | 0.1457719815 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | LARGE PELAGIC FISH |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |  0.179241174 |  0 |  0 |            0 |            0 |            0 |            0 | 0.1948273631 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1005945364 |            0 |  0.088228963 | 0.0879970257 |            0 |  0 | 0.1257385828 | 0.0897764489 | 0.0050098465 | 0.1285860596 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |  0.129932787 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1813645152 | 0.0144369763 |  0.140244913 | 0.1370039591 |            0 |  0 | 0.1495258264 | 0.1811987846 | 0.0662922383 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.3610326745 | 0.0968132311 | 0.2662363856 | 0.1549011698 |            0 |  0 |            0 |            0 | 0.1210165389 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 | 0.0784021727 |            0 | 0.1142431659 | 0.1176032591 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1194893491 | 0.0215605975 |  0.093242584 | 0.1127031233 |            0 |  0 | 0.1121431077 | 0.0983089744 |  0.104862906 | 0.0274407604 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | OCTOPUS            |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 | 0.0674902386 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1142142499 | 0.1373908428 | 0.1032203649 | 0.1855981561 |            0 |  0 | 0.1574772233 | 0.0771317012 | 0.0899869848 | 0.0674902386 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 | 0.0641443943 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1166261715 | 0.1160708087 |   0.11225269 | 0.0962165915 |            0 |  0 | 0.1069073238 | 0.1924331829 | 0.0991322457 | 0.0962165915 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            1 |            0 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 | 0.2030669844 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1460657256 | 0.1055948319 |  0.169222487 | 0.0714494945 |            0 |  0 | 0.1015334922 | 0.0676889948 | 0.0676889948 | 0.0676889948 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | SEA URCHIN         |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 | 0.0445542466 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0222771233 | 0.1951900329 |  0.093563918 | 0.0811523778 | 0.0687101635 |            0 |  0 | 0.1169548975 | 0.0891084933 | 0.2160880962 | 0.0724006508 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 | 0.0445542466 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0222771233 | 0.1951900329 |  0.093563918 | 0.0811523778 | 0.0687101635 |            0 |  0 | 0.1169548975 | 0.0891084933 | 0.2160880962 | 0.0724006508 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 | 0.0445542466 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0222771233 | 0.1951900329 |  0.093563918 | 0.0811523778 | 0.0687101635 |            0 |  0 | 0.1169548975 | 0.0891084933 | 0.2160880962 | 0.0724006508 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 | 0.0445542466 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0222771233 | 0.1951900329 |  0.093563918 | 0.0811523778 | 0.0687101635 |            0 |  0 | 0.1169548975 | 0.0891084933 | 0.2160880962 | 0.0724006508 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | VIDRIOLA           |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |  0.043956044 | 0.0879120879 |  0.043956044 | 0.2637362637 |            0 |  0 | 0.1648351648 |  0.043956044 | 0.3076923077 |  0.043956044 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 | 0.0471698113 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1061320755 | 0.0825471698 |            0 | 0.4811320755 |            0 |  0 |  0.141509434 | 0.0943396226 | 0.0471698113 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.3403141361 | 0.4123036649 |            0 |  0.247382199 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.3150984683 | 0.5120350109 |            0 |            0 |            0 |  0 | 0.0853391685 | 0.0875273523 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Small Crustacean   |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0596908971 | 0.0556210632 | 0.0862445683 | 0.0566597187 |            0 |  0 | 0.3469533395 | 0.1318173978 | 0.1734766697 | 0.0895363457 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 | 0.0448457636 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |  0.112114409 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1476173052 | 0.0494849805 |  0.045593193 | 0.0287760316 |            0 |  0 | 0.0840858068 | 0.1843659171 | 0.1502333081 |  0.152883285 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0996254379 |  0.062719857 | 0.0730112138 | 0.0445194333 |            0 |  0 | 0.1761235421 | 0.1958351466 | 0.1404269237 | 0.2077384456 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.2250866738 | 0.0530634335 | 0.0723386123 | 0.0432514081 |            0 |  0 | 0.1972871245 | 0.1394162346 | 0.0841066162 |  0.185449897 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Mollusca           |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 | 0.2631578947 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1578947368 | 0.3684210526 |            0 | 0.1578947368 |            0 |  0 |            0 |            0 |            0 | 0.0526315789 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1818181818 | 0.8181818182 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 | 0.1357228718 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |  0.746475795 | 0.0528903945 | 0.0649109387 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |  0.460815047 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1880877743 | 0.1536050157 |  0.065830721 |            0 |            0 |  0 |            0 |            0 |  0.065830721 |  0.065830721 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Anguila            |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 | 0.1448842384 |            0 | 0.0231814781 | 0.0434652715 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0144884238 | 0.0338806219 | 0.0190088121 | 0.0405675867 |            0 |  0 | 0.1225306702 | 0.1837776073 | 0.1757238834 | 0.1984914066 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 | 0.0388576886 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0400351943 | 0.1086576108 | 0.1878121617 |            0 |            0 |  0 | 0.1521926138 | 0.1493862251 | 0.2043266793 | 0.1187318263 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0223488142 | 0.0275848221 | 0.2145486162 |            0 |            0 |  0 | 0.1802378653 | 0.1713664502 |  0.210611067 | 0.1733023651 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 | 0.0470617549 |            0 | 0.0062749007 | 0.0439243046 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0728853846 | 0.0608665364 |  0.032695535 | 0.0508050577 |            0 |  0 | 0.1688247082 | 0.1559761021 | 0.1716112366 | 0.1890744792 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Orange Roughy      |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1105920043 | 0.1591136622 | 0.3062804512 | 0.0732163118 | 0.0732163118 | 0.0732163118 | 0.0732163118 |            0 |            0 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 | 0.0397116732 | 0.0914369619 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1105920043 | 0.1591136622 | 0.3062804512 | 0.0732163118 | 0.0732163118 | 0.0732163118 | 0.0732163118 |            0 |            0 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 | 0.0397116732 | 0.0914369619 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1105920043 | 0.1591136622 | 0.3062804512 | 0.0732163118 | 0.0732163118 | 0.0732163118 | 0.0732163118 |            0 |            0 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 | 0.0397116732 | 0.0914369619 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.1105920043 | 0.1591136622 | 0.3062804512 | 0.0732163118 | 0.0732163118 | 0.0732163118 | 0.0732163118 |            0 |            0 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 | 0.0397116732 | 0.0914369619 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Alfonsino          |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0096696213 |            0 | 0.3464443997 | 0.1187676269 | 0.1187676269 | 0.1187676269 | 0.1187676269 |            0 |            0 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 | 0.1688154714 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0096696213 |            0 | 0.3464443997 | 0.1187676269 | 0.1187676269 | 0.1187676269 | 0.1187676269 |            0 |            0 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 | 0.1688154714 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0096696213 |            0 | 0.3464443997 | 0.1187676269 | 0.1187676269 | 0.1187676269 | 0.1187676269 |            0 |            0 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 | 0.1688154714 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0096696213 |            0 | 0.3464443997 | 0.1187676269 | 0.1187676269 | 0.1187676269 | 0.1187676269 |            0 |            0 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 | 0.1688154714 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Chondricties       |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 |            0 |  0 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 |            0 |  0 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 |            0 |  0 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 |            0 |  0 | 0.0666666667 | 0.0666666667 | 0.0666666667 | 0.0666666667 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Otariids           |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |  0.001880243 |            0 | 0.0914087359 | 0.4117008967 |            0 |  0 |            0 |            0 |            0 | 0.4950101244 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |  0.001880243 |            0 | 0.0914087359 | 0.4117008967 |            0 |  0 |            0 |            0 |            0 | 0.4950101244 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |  0.001880243 |            0 | 0.0914087359 | 0.4117008967 |            0 |  0 |            0 |            0 |            0 | 0.4950101244 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |  0.001880243 |            0 | 0.0914087359 | 0.4117008967 |            0 |  0 |            0 |            0 |            0 | 0.4950101244 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Cetaceous          |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 | 0.0051176062 | 0 | 0 | 0 | 0.0248377648 | 0 | 0 | 0 | 0 | 0.0067523971 |  0 |  0 |  0 |  0 |  0 | 0.0067523971 |  0 | 0.0915340735 | 0.0028431146 |  0 |  0 | 0.0067523971 | 0.3838204668 | 0.0047977558 | 0.0338804486 | 0.0028431146 | 0.0360127845 |            0 |            0 |            0 | 0.0073920979 |            0 |            0 | 0.0028431146 |            0 | 0.3838204668 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 | 0.0051176062 | 0 | 0 | 0 | 0.0248377648 | 0 | 0 | 0 | 0 | 0.0067523971 |  0 |  0 |  0 |  0 |  0 | 0.0067523971 |  0 | 0.0915340735 | 0.0028431146 |  0 |  0 | 0.0067523971 | 0.3838204668 | 0.0047977558 | 0.0338804486 | 0.0028431146 | 0.0360127845 |            0 |            0 |            0 | 0.0073920979 |            0 |            0 | 0.0028431146 |            0 | 0.3838204668 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 | 0.0051176062 | 0 | 0 | 0 | 0.0248377648 | 0 | 0 | 0 | 0 | 0.0067523971 |  0 |  0 |  0 |  0 |  0 | 0.0067523971 |  0 | 0.0915340735 | 0.0028431146 |  0 |  0 | 0.0067523971 | 0.3838204668 | 0.0047977558 | 0.0338804486 | 0.0028431146 | 0.0360127845 |            0 |            0 |            0 | 0.0073920979 |            0 |            0 | 0.0028431146 |            0 | 0.3838204668 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 | 0.0051176062 | 0 | 0 | 0 | 0.0248377648 | 0 | 0 | 0 | 0 | 0.0067523971 |  0 |  0 |  0 |  0 |  0 | 0.0067523971 |  0 | 0.0915340735 | 0.0028431146 |  0 |  0 | 0.0067523971 | 0.3838204668 | 0.0047977558 | 0.0338804486 | 0.0028431146 | 0.0360127845 |            0 |            0 |            0 | 0.0073920979 |            0 |            0 | 0.0028431146 |            0 | 0.3838204668 |            0 |            0 |            0 |  0 |            0 |            0 |            0 |            0 |     0 |  0 |            0 |  0 |            0 |            0 |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | Birds              |   |              |   |   |   |              |   |   |   |   |              |    |    |    |    |    |              |    |              |              |    |    |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |              |    |              |              |              |              |       |    |              |    |              |              |
        |--------------------+---+--------------+---+---+---+--------------+---+---+---+---+--------------+----+----+----+----+----+--------------+----+--------------+--------------+----+----+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----+--------------+--------------+--------------+--------------+-------+----+--------------+----+--------------+--------------|
        | S1                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |        0.125 |        0.125 |        0.125 |        0.125 |            0 |  0 |            0 |        0.125 |        0.125 |        0.125 | 0.125 |  0 |            0 |  0 |            0 |            0 |
        | S2                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |        0.125 |        0.125 |        0.125 |        0.125 |            0 |  0 |            0 |        0.125 |        0.125 |        0.125 | 0.125 |  0 |            0 |  0 |            0 |            0 |
        | S3                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |        0.125 |        0.125 |        0.125 |        0.125 |            0 |  0 |            0 |        0.125 |        0.125 |        0.125 | 0.125 |  0 |            0 |  0 |            0 |            0 |
        | S4                 | 0 |            0 | 0 | 0 | 0 |            0 | 0 | 0 | 0 | 0 |            0 |  0 |  0 |  0 |  0 |  0 |            0 |  0 |            0 |            0 |  0 |  0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |            0 |        0.125 |        0.125 |        0.125 |        0.125 |            0 |  0 |            0 |        0.125 |        0.125 |        0.125 | 0.125 |  0 |            0 |  0 |            0 |            0 |
  - [X] For lobster in winter distribution I use the mean between spring and autumm
  - [X] For Large pelagic fish, Mollusca, Octupus, Small bentic fish and small crustacean, I use the average distribution for all the seasons.
- [X] Deph Distribution
      | Functional Groups | Min |  Max | Author                                                              |
      |-------------------+-----+------+---------------------------------------------------------------------|
      | SPL               |   2 |  250 | Retamal & Arana 2000  - Descripcion y distribucion de 5 decapodos   |
      | GCR               | 100 | 1000 | Arana et al 2000  -  Pesca exploratoria                             |
      | BRC               |  20 |  300 | Arana & Vega 2000  -  Pesca exploratoria espinel and billy DB       |
      | ORO               | 500 | 1000 | Niklitschek 2007 evaluacion hidroacustica alfonsino y otange roughy |
      | ALF               | 200 |  600 | Niklitschek 2007 evaluacion hidroacustica alfonsino y otange roughy |
      | LPF               |   0 |  200 | Billy data base                                                     |
      | SPF               |   0 |  250 | Billy data base                                                     |
      | SBF               |   0 |  250 | Billy data base                                                     |
      | LBF               |   0 |  250 | Billy data base                                                     |
      | VID               |   3 |  150 | IUCN and fish-base                                                  |
      | ANG               |   0 |  300 | Arana 2000 - PEsca exploratoria con trampa                          |
      |                   |     |      |                                                                     |
- [X] Day-nigth distribution [2/2]
  - [X] Vertebrates
       | FG  | JvAd  | Ligth |      Deepest |              |              |              |              |              |              |      Surface | Source         |
       |-----+-------+-------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----------------|
       | ANG | Both  | Both  |            1 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | Billy Database |
       | BRC | Adult | Both  |  0.065894115 | 0.0665757782 | 0.0077255169 | 0.0645307885 | 0.3583276528 | 0.2094978414 | 0.1376959782 |  0.089752329 | Billy Database |
       | BRC | Juv   | Both  | 0.0084033613 |  0.037214886 | 0.0288115246 | 0.0336134454 | 0.3709483794 | 0.2088835534 | 0.2172869148 | 0.0948379352 | Billy Database |
       | LBF | Both  | Both  |            0 | 0.0535714286 |            0 | 0.1160714286 | 0.4553571429 | 0.2053571429 | 0.0982142857 | 0.0714285714 | Billy Database |
       | LPF | Both  | Both  |            0 |            0 |            0 | 0.0031051079 | 0.0009315324 | 0.0099363453 | 0.0353206024 |  0.950706412 | Billy Database |
       | SBF | Both  | Both  |  0.223316913 | 0.2561576355 | 0.1871921182 |  0.144499179 | 0.0870279146 | 0.0295566502 |  0.039408867 | 0.0328407225 | Billy Database |
       | SPF | Both  | Both  |            0 |            0 |            0 | 0.0684931507 |            0 | 0.0904109589 | 0.1246575342 | 0.7164383562 | Billy Database |
       | VID | Both  | Both  |            0 |            0 |            0 | 0.0051813472 | 0.1191709845 |  0.067357513 |  0.103626943 | 0.7046632124 | Billy Database |
       | ALF | Both  | Both  |  0.119487909 | 0.0871266003 | 0.1123755334 | 0.4327880512 | 0.1470483642 | 0.0460526316 | 0.0551209104 |            0 | Billy Database |
       | ORO | Both  | Both  | 0.4119850187 |  0.240948814 | 0.3121098627 | 0.0312109863 | 0.0037453184 |            0 |            0 |            0 | Billy Database |
       |     |       |       |              |              |              |              |              |              |              |              |                |
  - [X] Invertebrates
         | FG  | Light | Deepest layer |              |              |              |              |              |              |      Surface | Source         |
         |-----+-------+---------------+--------------+--------------+--------------+--------------+--------------+--------------+--------------+----------------|
         | GCR | D     |             1 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | Billy Database |
         | GCR | N     |             1 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | Billy Database |
         | SPL | D     |             1 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | Billy Database |
         | SPL | N     |             1 |            0 |            0 |            0 |            0 |            0 |            0 |            0 | Billy Database |
         | OCT | D     |           0.8 |          0.2 |            0 |            0 |            0 |            0 |            0 |            0 | Billy Database |
         | OCT | N     |           0.5 |          0.3 |          0.2 |            0 |            0 |            0 |            0 |            0 | Billy Database |
         | COP | D     |             0 |            0 |            0 | 0.0034546292 | 0.1273606633 | 0.3287655458 | 0.5404191617 |            0 | Antesana  2009 |
         | COP | N     |  0.0295087372 | 0.0602538741 | 0.0787174415 | 0.0787174415 | 0.0492087043 | 0.0049455984 | 0.0085723706 | 0.6900758325 | Antesana 2009  |
         | EUF | D     |             0 |  0.021312873 |  0.028417164 | 0.1449275362 | 0.0824097755 | 0.2750781472 | 0.2810457516 | 0.1668087525 | Hidalgo,2005   |
         | EUF | N     |             0 |            0 |            0 |            0 |            0 | 0.0044113875 | 0.2979738394 |  0.697614773 | Hidalgo, 2005  |
         | SUR | D     |             1 |            0 |            0 |            0 |            0 |            0 |              |              |                |
         | SUR | N     |             1 |            0 |            0 |            0 |            0 |            0 |              |              |                |
         | MOL | D     |             1 |            0 |            0 |            0 |            0 |            0 |              |              |                |
         | MOL | N     |             1 |            0 |            0 |            0 |            0 |            0 |              |              |                |
- [X] Speed movement
    | Functional group | Speed m.hr-1 | Specie or group | Real speed reported | Source                                  |
    |------------------+--------------+-----------------+---------------------+-----------------------------------------|
    | SPL              |         1260 | Lobster         | 35 cm*sec-1         | Childress and Jury. Chapter 3-behaviour |
    | GCR              |          450 | Gost crab       | 0.45 K*h            | Tully and andrus 2011                   |
    | BRC              |         2228 | Acanthuridae    | 61.9cm*s            | Fulton et al. 2005                      |
    | ORO              |         1440 | Trachinidae     | 0.4 m*s             | Fishbase                                |
    | ALF              |              |                 |                     |                                         |
    | CHO              |              |                 |                     |                                         |
    | BIR              |              |                 |                     |                                         |
    | LPF              |              |                 |                     |                                         |
    | SPF              |              |                 |                     |                                         |
    | LBF              |              |                 |                     |                                         |
    | SBF              |              |                 |                     |                                         |
    | EUP              |              |                 |                     |                                         |
    | COP              |              |                 |                     |                                         |
    | SUR              |              |                 |                     |                                         |
    | MOL              |              |                 |                     |                                         |
- [X] look for the depth distribution of the functional groups
  For this, I use the information in SETas model and references
- [X] Migration
  - Day of migration
     | Species  | Month               | Reference   |
     |----------+---------------------+-------------|
     | Vidriola | Spring-Summer       | Arana 2000b |
     | Whales   | Leave during winter |             |
     | Birds    | Srping and summer   | OIKONOS     |

    - Vidriola catch analisys
    #+BEGIN_SRC R
    ##libraries
    library(ggplot2)
    setwd("/home/demiurgo/Documents/PhD/Functional_groups/Migration/Vidriola/")
    vid.io            <- read.table('Vid_month.txt', sep = ' ', header = TRUE)
    s                 <- qplot(as.factor(Month), Weight, data = vid.io, geom=c("boxplot"), xlab = 'Month', ylab = 'Biomass (kg)')
    mean.month        <- with(vid.io, aggregate(Weight~as.factor(Month), FUN = mean))
    mean.month$Weight <- mean.month$Weight / sum(mean.month$Weight)
    png('migration_Vid.png')
    par(mar=c(5,4,4,5)+.1)
    boxplot(Weight~as.factor(Month), data = vid.io, col = 'grey', bty = 'n', outline = FALSE, xlab = 'Months', ylab = 'Catch (Number)', border = 'white', las = 1,
            main = 'Vidriola Migration')
    par(new = TRUE)
    plot(as.numeric(mean.month[, 1]), mean.month[, 2], type = 'b', pch = 20, col = 2, axes = F, xlab = '', ylab = '', bty = 'n')
    axis(4, col = 2, las = 1)
    mtext("Proportion", side=4, line=3)
    dev.off()
    #+END_SRC
  - Initial condition (Abundance) for migrating species
    - Vidriola
       I use the length converted catch curve to estimate Z.
     #+BEGIN_SRC R
       #-------------------------------------#
       # Estimation of abundance using APV   #
       #------------------------------------ #
       vid.io            <- read.table('/home/demiurgo/Documents/PhD/Functional_groups/Migration/Vidriola/Vid_month.txt', sep = ' ', header = TRUE)
       lfd               <- read.csv('/home/demiurgo/Documents/PhD/Functional_groups/Migration/Vidriola/VID.csv')
       sum.season        <- with(vid.io, aggregate(Weight~as.factor(Season), FUN = sum))
       dist              <- lfd$count/sum(lfd$count)
       mean.month        <- with(vid.io, aggregate(Weight~as.factor(Month), FUN = mean))
       mean.month$Weight <- mean.month$Weight / sum(mean.month$Weight)
       vec               <- c(t(outer(sum.season[8:10,2],mean.month[,2])))
       total             <- t(outer(vec, dist))
       dates             <- format(seq(as.Date('2013-01-30'), by='months',length.out=36), '%d/%m/%Y')
       colnames(total)   <- as.character(dates)
       total             <- cbind(id=lfd[,2],total)
       # write.table(total, 'Vid_lccc.txt',row.names=FALSE,sep=',')
       #~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~#
       #  Using length converted catch curve to estimate z  #
       #~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~#
       # source('ElefanI.R')
       source('/home/demiurgo/Documents/PhD/Functional_groups/Migration/Vidriola/Lccc.R')
       # ElefanI(data, vbplot = TRUE)
       data <- '/home/demiurgo/Documents/PhD/Functional_groups/Migration/Vidriola/Vid_lccc.txt'
       dat  <- Lccc(data, Linf = 964.95, K = 0.82, auto = FALSE, save = TRUE, quiet = TRUE)
       Z    <- dat$Z_Estimate[1]
       M    <- 0.2
       # -  -  -  -  -  -  -  -  -  -  -  -  -  - #
       # Last abundance  Using Baranov equation    #
       # -  -  -  -  -  -   -  -  -  -  -  -  - - #
       abun.l <- (sum.season[10, 2] * Z) / ((Z - M) * (1 - exp( -  Z)))
       print(abun.l)

    #+END_SRC

     #+RESULTS:
     : [1] 7524.351
      - the values of Z and natural moratily for Vidriola area
        | Location    | Natural moratality | Reference               |
        |-------------+--------------------+-------------------------|
        | New zealand |                0.2 | Holdsworth et al (2013) |
        | Z           |               2.35 | Using LCCC              |
        |-------------+--------------------+-------------------------|
      - Estimation of abundance by year for Vidriola
        #+BEGIN_SRC R
       library('mixdist')
       abundance  <- 7524
       lfd        <- read.csv('/home/demiurgo/Documents/PhD/Functional_groups/Migration/Vidriola/VID.csv')
       parameters <- mixparam(mu    = c(578.0951131, 671.6419074, 782.6210876),
                              sigma = c(12.62, 31.20, 46.63),
                              pi    = c(0.073111427, 0.511703986, 0.415184587))
       VID.res    <- mix(lfd[, c(2, 3)], mixpar = parameters, emsteps = 100, iterlim = 3000, 'norm')
       print(VID.res)
       plot(VID.res)
       N.age      <- VID.res[[1]][, 1] * abundance
       print(N.age)
    #+END_SRC

     #+RESULTS:
     | 616.217874274424 |
     | 3603.23440357457 |
     | 3304.54772215101 |
    - Whales
      - Relative Abundance
         | Year         | Abundance index | Reference                               |
         |--------------+-----------------+-----------------------------------------|
         | 1997-1998    |            0.15 | Huke and Gaete 1998 (sensu Aguayo 1998) |
         | 1958         |           14.35 | Clarrke (1962)                          |
         | 1964         |            1.25 | Clarke (1998)                           |
         | 1994 - May   |            1.14 | Aguayo-lobo 1998                        |
         | 1995-sep     |           50.63 | Aguayo-lobo 1998                        |
         | 1995-Jun,jul |            1.89 | Aguayo-lobo 1998                        |
         | 1997         |            2.71 | Aguayo lobo 1998                        |
         | 1982         |               1 | Gallardo y Pastene                      |
         | 1994-May     |            0.13 | Aguallo-lobo 1998                       |
         | 1994-sept    |            0.25 | Aguallo-Lobo 1998                       |
         | 1995-sept    |            0.63 | Aguallo-Lobo 1998                       |
         |              |                 |                                         |
      - Abundance (N)
         | Latitud    | Sperm-whale | Humpback Whale | Blue Whale | Bryde Whale | Right Whale |
         |------------+-------------+----------------+------------+-------------+-------------|
         | 60  - 70   |             |                |            |             |             |
         | 50  - 60   |             |                |            |             |             |
         | 40  - 50   |           8 |              2 |            |             |             |
         | 30  - 40   |          97 |             38 |        132 |          15 |             |
         | 20 - 30    |         119 |           1772 |         69 |          15 |             |
         | 10 - 20    |          37 |             24 |         28 |          18 |             |
         | 0  - 10    |        1942 |            537 |         72 |          74 |             |
         | 0  - -10   |        2413 |            765 |         47 |          97 |             |
         | -10  - -20 |         321 |             53 |         27 |          84 |          10 |
         | -20  - -30 |        1788 |             23 |         24 |          83 |          24 |
         | -30  - -40 |         117 |             46 |         32 |           7 |          63 |
         | -40  - -50 |          22 |            274 |        165 |           7 |             |
         | -50  - -60 |           5 |             32 |            |           1 |          13 |
         | -60  - -70 |           2 |             27 |         24 |             |             |
         | -70  - -80 |             |                |            |           3 |             |
         |------------+-------------+----------------+------------+-------------+-------------|
         | TOTAL      |        6863 |           3599 |        596 |         399 |         141 |
         | %          |        59.2 |           31.0 |        5.1 |         3.4 |           1 |
         |------------+-------------+----------------+------------+-------------+-------------|
      - Value using the maximun available number
         936
    - Birds (Mostly Fardela)
      Oikonos tag information  :  8601 individuals
  - Estimation of Reserve weight and structural weight
    - Vidriola
         The ratio between structural weigth and reserve weight is 1:2.65
     #+BEGIN_SRC R
       ##-----------------------------------------------#
       ##     Estimation of Wl for Vidriola             #
       ##-----------------------------------------------#

       wl <- read.csv('/home/demiurgo/Documents/PhD/Functional_groups/Migration/Vidriola/Vid_WL.prn')
       ## ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ ##
       ## ~                     Estimation of length weight relationship                 ~ ##
       ## ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ ##
       WL.relationship <- function(alfa, beta, len){
           weight <- alfa * len ^ beta
           return(weight)
       }
       len.obs <- wl$Fork_len
       wei.obs <- wl$Weight
       res     <- nls(wei.obs ~ WL.relationship(alfa, beta, len.obs), start = c(alfa = 0.02, beta = 1.7))
       param   <- coefficients(res)
       av.size <- c(580.2, 667.4, 776.4)
       t.wei   <- WL.relationship(param[1],param[2], av.size)
       plot(len.obs, wei.obs,pch = 19, col = 'grey', bty = 'n')
       lines(len.obs,WL.relationship(param[1], param[2],len.obs),col = 2)
       points(av.size, t.wei, pch = 19)
       ## Generaly the ratio between structural weight and reserve weight is 1:2.65
       ##  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -
       factor  <- t.wei / 3.65
       out     <- data.frame(structural = factor, reserve = factor * 2.65)
       print(out)
     #+END_SRC

     #+RESULTS:
     | 643.030754827798 | 1704.03150029367 |
     | 970.527071999435 |  2571.8967407985 |
     | 1514.12793004129 | 4012.43901460942 |
    - Whales
      | Average weight | Average (gr) | Specie                     | Common name        | Source |
      |----------------+--------------+----------------------------+--------------------+--------|
      | 1000 - 3000 kg |      2000000 | Globicephala macrorhynchus | Pilot Whale        | NOAA   |
      | 300 - 635 kg   |       467500 | Tursiops truncatus         | Bottlenose Dolphin | NOAA   |
      | 13607 - 40823  |     27215000 | Physeter macrocephalus     | Sperm Whale        | NOAA   |
      |----------------+--------------+----------------------------+--------------------+--------|
      | Total Average  |      9894166 |                            |                    |        |

      - Reserve weight and structural weight (1 : 2.65)
	Structural weight  =  36113708
	Reserve weight     =  95701327
    - Birds
      |  Weight | Avera weight (gr) | Structural | Reserve | reference                                                     |
      |---------+-------------------+------------+---------+---------------------------------------------------------------|
      | 580-900 |               740 |     202.74 |  537.26 | http://www.oiseaux-birds.com/card-pink-footed-shearwater.html |
- Availability matrix
  - I will leave this one for the last part

  - Ask to Beth!!!

    - What are the parameter needits

    -

