MandM/Methods.html
<li><code>[&nbsp;]</code> Activity period (day-night)
</li>
<li><code>[-]</code> Spatial distribution juvenile and adult (case of jurelilo-jurel)
<ul>
<li><code>[&nbsp;]</code> for crustacean I used as division the maturity
<ul>
<li>106.62 for Golden crab, based in Ernst 2013 report (it is the most conservative value)
</li>
<li>72.2 for robinson and 74.8 for selkirk are the values of maturity for lobster. I used the mean between both values 73.5
</li>
</ul>

</li>
<li><code>[X]</code> For the division Adult and juvenile for breca Breca I use 282 mm  of Fork length Based on Rivara Thesis
</li>
<li>To use the information by weight I use the mean weight in the catches
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Functional Group</th><th scope="col" class="right">Mean weight</th><th scope="col" class="left">Reference</th></tr>
</thead>
<tbody>
<tr><td class="left">Octopus</td><td class="right">723</td><td class="left">Arancibia 2005</td></tr>
<tr><td class="left">Breca</td><td class="right">746</td><td class="left">Billy DB</td></tr>
<tr><td class="left">Anguila</td><td class="right">1013</td><td class="left">Billy DB</td></tr>
</tbody>
</table>


</li>
</ul>

</li>
<li><code>[X]</code> Effect of ph in crustacean  -  Acidification at the moment is settle to 1 (line 770)
<ul>
<li>There is effect on behavior in other species of crustacean
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> Light penetration through the water column
<ul>
<li>Ask Caly abouyt this
</li>
</ul>

</li>
<li><code>[X]</code> distribution by zone [7/7]
<ul>
<li><code>[X]</code> Orange Roughy  -  Nicklitschek 2007 (evaluacion hidroacustica alfonsino y orange
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Zone</th><th scope="col" class="right">2003</th><th scope="col" class="right">2004</th><th scope="col" class="right">2005</th><th scope="col" class="right">2006</th><th scope="col" class="right">Average</th><th scope="col" class="right">Zones<sub>Atlantis</sub></th></tr>
</thead>
<tbody>
<tr><td class="left">JF1</td><td class="right">2196</td><td class="right">2019</td><td class="right">9590</td><td class="right">3749</td><td class="right">4388</td><td class="right">31,32,33,34</td></tr>
<tr><td class="left">JF2</td><td class="right">7246</td><td class="right">6062</td><td class="right">2847</td><td class="right">2201</td><td class="right">4589</td><td class="right">30</td></tr>
<tr><td class="left">JF3</td><td class="right">4536</td><td class="right">1905</td><td class="right">1531</td><td class="right">1565</td><td class="right">2384</td><td class="right">29</td></tr>
<tr><td class="left">JF4</td><td class="right">2981</td><td class="right">1572</td><td class="right">1586</td><td class="right">492</td><td class="right">1657</td><td class="right">28</td></tr>
<tr><td class="left">BO1</td><td class="right"></td><td class="right">927</td><td class="right">1813</td><td class="right"></td><td class="right">1370</td><td class="right">50</td></tr>
<tr><td class="left">BO2</td><td class="right"></td><td class="right">654</td><td class="right">536</td><td class="right"></td><td class="right">595</td><td class="right">49</td></tr>
</tbody>
<tbody>
<tr><td class="left">Total</td><td class="right">16959</td><td class="right">13139</td><td class="right">17903</td><td class="right">8007</td><td class="right"></td><td class="right"></td></tr>
</tbody>
</table>


</li>
<li><code>[X]</code> Alfonsino -  Nicklitschek 2007 (evaluacion hidroacustica alfonsino y orange roughy)
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="right" /><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Zone</th><th scope="col" class="right">2005</th><th scope="col" class="right">2006</th><th scope="col" class="right">Average</th><th scope="col" class="left">Zones<sub>atlantis</sub></th></tr>
</thead>
<tbody>
<tr><td class="left">JF1</td><td class="right">7608</td><td class="right">11258</td><td class="right">9433</td><td class="left">31,32,33,34</td></tr>
<tr><td class="left">JF2</td><td class="right">10646</td><td class="right">3112</td><td class="right">6879</td><td class="left">30</td></tr>
<tr><td class="left">JF4</td><td class="right">181</td><td class="right">203</td><td class="right">192</td><td class="left">28</td></tr>
<tr><td class="left">JF6</td><td class="right"></td><td class="right">3352</td><td class="right">3352</td><td class="left">47</td></tr>
</tbody>
<tbody>
<tr><td class="left">Total</td><td class="right">18435</td><td class="right">17925</td><td class="right"></td><td class="left"></td></tr>
</tbody>
</table>

</li>
<li><code>[X]</code> Chondricties - Info take it from andrade 2007 and 2008 biodiversity of seamount (it a guestimation)
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Zone</th><th scope="col" class="left">N/Presence</th><th scope="col" class="left">Zones</th><th scope="col" class="left">Reference</th></tr>
</thead>
<tbody>
<tr><td class="left">JF1</td><td class="left">10</td><td class="left">31,32,33,34</td><td class="left">Yaez et al</td></tr>
<tr><td class="left">JF2</td><td class="left">1</td><td class="left">30</td><td class="left"></td></tr>
<tr><td class="left">JF3</td><td class="left">Presence</td><td class="left">29</td><td class="left">Andrade et al 2008</td></tr>
<tr><td class="left">JF4</td><td class="left">Presence</td><td class="left">28</td><td class="left">Andrade et al 2008</td></tr>
<tr><td class="left">Robinson</td><td class="left">Presence</td><td class="left">35,36,37,38</td><td class="left">Arana  2000</td></tr>
<tr><td class="left">Selkirk</td><td class="left">Presence</td><td class="left">41,42,43,44</td><td class="left">Arana 2000</td></tr>
</tbody>
</table>

</li>
<li><code>[X]</code> Cetaceus-Info from Aguayo et al 1998. I use the map provided in the manuscript as a proxi for the spatial location
</li>
<li><code>[X]</code> Table distribution functional groups
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">ZONE</th><th scope="col" class="right">0</th><th scope="col" class="right">1</th><th scope="col" class="right">2</th><th scope="col" class="right">3</th><th scope="col" class="right">4</th><th scope="col" class="right">5</th><th scope="col" class="right">6</th><th scope="col" class="right">7</th><th scope="col" class="right">8</th><th scope="col" class="right">9</th><th scope="col" class="right">10</th><th scope="col" class="right">11</th><th scope="col" class="right">12</th><th scope="col" class="right">13</th><th scope="col" class="right">14</th><th scope="col" class="right">15</th><th scope="col" class="right">16</th><th scope="col" class="right">17</th><th scope="col" class="right">18</th><th scope="col" class="right">19</th><th scope="col" class="right">20</th><th scope="col" class="right">21</th><th scope="col" class="right">22</th><th scope="col" class="right">23</th><th scope="col" class="right">24</th><th scope="col" class="right">25</th><th scope="col" class="right">26</th><th scope="col" class="right">27</th><th scope="col" class="right">28</th><th scope="col" class="right">29</th><th scope="col" class="right">30</th><th scope="col" class="right">31</th><th scope="col" class="right">32</th><th scope="col" class="right">33</th><th scope="col" class="right">34</th><th scope="col" class="right">35</th><th scope="col" class="right">36</th><th scope="col" class="right">37</th><th scope="col" class="right">38</th><th scope="col" class="right">39</th><th scope="col" class="right">40</th><th scope="col" class="right">41</th><th scope="col" class="right">42</th><th scope="col" class="right">43</th><th scope="col" class="right">44</th><th scope="col" class="right">45</th><th scope="col" class="right">46</th><th scope="col" class="right">47</th><th scope="col" class="right">48</th><th scope="col" class="right">49</th><th scope="col" class="right">50</th></tr>
</thead>
<tbody>
<tr><td class="left">Spiny Lobster</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">Adulto</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0403034528</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0806069056</td><td class="right">0.0738377929</td><td class="right">0.070389792</td><td class="right">0.0767029136</td><td class="right">0.0749129289</td><td class="right">0</td><td class="right">0</td><td class="right">0.132014371</td><td class="right">0.1433215209</td><td class="right">0.1509611786</td><td class="right">0.1569491436</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0531965438</td><td class="right">0.0641715589</td><td class="right">0.0612190647</td><td class="right">0.0722256419</td><td class="right">0</td><td class="right">0</td><td class="right">0.1890284955</td><td class="right">0.1727596496</td><td class="right">0.196821136</td><td class="right">0.1905779094</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.02229249</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0198155467</td><td class="right">0.055078526</td><td class="right">0.0727261578</td><td class="right">0.0618825223</td><td class="right">0.0706299865</td><td class="right">0</td><td class="right">0</td><td class="right">0.1702537003</td><td class="right">0.1699207961</td><td class="right">0.1825064159</td><td class="right">0.1748938582</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0410355774</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0364760688</td><td class="right">0.0566608596</td><td class="right">0.0799186964</td><td class="right">0.0624403444</td><td class="right">0.0692883908</td><td class="right">0</td><td class="right">0</td><td class="right">0.1544682217</td><td class="right">0.1675339439</td><td class="right">0.1704708807</td><td class="right">0.1617070164</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">Juvenil</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1275294424</td><td class="right">0.1366386883</td><td class="right">0.1566790292</td><td class="right">0.1311731407</td><td class="right">0</td><td class="right">0</td><td class="right">0.0546554753</td><td class="right">0.1093109506</td><td class="right">0.1639664259</td><td class="right">0.1200468476</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1275294424</td><td class="right">0.1366386883</td><td class="right">0.1566790292</td><td class="right">0.1311731407</td><td class="right">0</td><td class="right">0</td><td class="right">0.0546554753</td><td class="right">0.1093109506</td><td class="right">0.1639664259</td><td class="right">0.1200468476</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1275294424</td><td class="right">0.1366386883</td><td class="right">0.1566790292</td><td class="right">0.1311731407</td><td class="right">0</td><td class="right">0</td><td class="right">0.0546554753</td><td class="right">0.1093109506</td><td class="right">0.1639664259</td><td class="right">0.1200468476</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1275294424</td><td class="right">0.1366386883</td><td class="right">0.1566790292</td><td class="right">0.1311731407</td><td class="right">0</td><td class="right">0</td><td class="right">0.0546554753</td><td class="right">0.1093109506</td><td class="right">0.1639664259</td><td class="right">0.1200468476</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">GOLDEN CRAB</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">Adulto</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.2053267265</td><td class="right">0</td><td class="right">0.7946732735</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.2298358113</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.4201371827</td><td class="right">0.2208811693</td><td class="right">0.1291458368</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.329949859</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.5030241304</td><td class="right">0</td><td class="right">0.1670260107</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.3293860773</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.156850513</td><td class="right">0.2450789266</td><td class="right">0.0617153297</td><td class="right">0.140185146</td><td class="right">0.0667840075</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">Juvenil</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.2195121951</td><td class="right">0</td><td class="right">0.7804878049</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.2135693771</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.7016808701</td><td class="right">0.059324827</td><td class="right">0.0254249258</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0583261326</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.8861251697</td><td class="right">0</td><td class="right">0.0555486977</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.2585034014</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.2925170068</td><td class="right">0.1292517007</td><td class="right">0.3197278912</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">BRECA</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">Adulto</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1907245859</td><td class="right">0.3285586521</td><td class="right">0.2949575297</td><td class="right">0.1857592324</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0951066738</td><td class="right">0.3527888583</td><td class="right">0.268147983</td><td class="right">0.2839564848</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0372615911</td><td class="right">0.1018644797</td><td class="right">0.1590783314</td><td class="right">0.1647957023</td><td class="right">0.1344446778</td><td class="right">0</td><td class="right">0</td><td class="right">0.1098574497</td><td class="right">0.1010400289</td><td class="right">0.1018911785</td><td class="right">0.0897665605</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0498058587</td><td class="right">0.1041395228</td><td class="right">0.0938648876</td><td class="right">0.1300017329</td><td class="right">0.0841109145</td><td class="right">0</td><td class="right">0</td><td class="right">0.146841411</td><td class="right">0.1350555692</td><td class="right">0.1361932619</td><td class="right">0.1199868414</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">Juvenil</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0472483521</td><td class="right">0.4609743069</td><td class="right">0.1499145801</td><td class="right">0.171838691</td><td class="right">0.1700240699</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0472483521</td><td class="right">0.4609743069</td><td class="right">0.1499145801</td><td class="right">0.171838691</td><td class="right">0.1700240699</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0472483521</td><td class="right">0.4609743069</td><td class="right">0.1499145801</td><td class="right">0.171838691</td><td class="right">0.1700240699</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0472483521</td><td class="right">0.4609743069</td><td class="right">0.1499145801</td><td class="right">0.171838691</td><td class="right">0.1700240699</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">SMALL PELAGIC FISH</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.229184781</td><td class="right">0.0104938087</td><td class="right">0.2005816568</td><td class="right">0.2102959254</td><td class="right">0</td><td class="right">0</td><td class="right">0.0849998501</td><td class="right">0.163703415</td><td class="right">0</td><td class="right">0.1007405631</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.229184781</td><td class="right">0.0104938087</td><td class="right">0.2005816568</td><td class="right">0.2102959254</td><td class="right">0</td><td class="right">0</td><td class="right">0.0849998501</td><td class="right">0.163703415</td><td class="right">0</td><td class="right">0.1007405631</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.229184781</td><td class="right">0.0104938087</td><td class="right">0.2005816568</td><td class="right">0.2102959254</td><td class="right">0</td><td class="right">0</td><td class="right">0.0849998501</td><td class="right">0.163703415</td><td class="right">0</td><td class="right">0.1007405631</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.229184781</td><td class="right">0.0104938087</td><td class="right">0.2005816568</td><td class="right">0.2102959254</td><td class="right">0</td><td class="right">0</td><td class="right">0.0849998501</td><td class="right">0.163703415</td><td class="right">0</td><td class="right">0.1007405631</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">SMALL BENTIC FISH</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0469531948</td><td class="right">0</td><td class="right">0.1655100118</td><td class="right">0.1197306468</td><td class="right">0.1622019458</td><td class="right">0.1741180975</td><td class="right">0</td><td class="right">0</td><td class="right">0.0559295409</td><td class="right">0.0950802196</td><td class="right">0.1100465504</td><td class="right">0.0704297923</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0363512893</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.2998981365</td><td class="right">0.0636147562</td><td class="right">0.1344997703</td><td class="right">0.1006651088</td><td class="right">0</td><td class="right">0</td><td class="right">0.1246329918</td><td class="right">0.0894800967</td><td class="right">0.0872430943</td><td class="right">0.0636147562</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0808854832</td><td class="right">0.5065985526</td><td class="right">0.2103022563</td><td class="right">0.202213708</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.2126778069</td><td class="right">0.1114026608</td><td class="right">0.1933434608</td><td class="right">0.1291258114</td><td class="right">0</td><td class="right">0</td><td class="right">0.0850711228</td><td class="right">0.1012751462</td><td class="right">0.0860838742</td><td class="right">0.0810201169</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">LARGE BENTIC FISH</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0854092527</td><td class="right">0.0854092527</td><td class="right">0.256227758</td><td class="right">0.1921708185</td><td class="right">0</td><td class="right">0</td><td class="right">0.1814946619</td><td class="right">0.0854092527</td><td class="right">0.1138790036</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0454545455</td><td class="right">0.1363636364</td><td class="right">0.0454545455</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.6363636364</td><td class="right">0.0454545455</td><td class="right">0.0909090909</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1824871229</td><td class="right">0.1133186166</td><td class="right">0.5099337748</td><td class="right">0.0971302428</td><td class="right">0.0971302428</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0728859907</td><td class="right">0.1457719815</td><td class="right">0.1665965503</td><td class="right">0.2267564156</td><td class="right">0</td><td class="right">0</td><td class="right">0.0647875473</td><td class="right">0.0890828776</td><td class="right">0.0883466554</td><td class="right">0.1457719815</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">LARGE PELAGIC FISH</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.179241174</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1948273631</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1005945364</td><td class="right">0</td><td class="right">0.088228963</td><td class="right">0.0879970257</td><td class="right">0</td><td class="right">0</td><td class="right">0.1257385828</td><td class="right">0.0897764489</td><td class="right">0.0050098465</td><td class="right">0.1285860596</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.129932787</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1813645152</td><td class="right">0.0144369763</td><td class="right">0.140244913</td><td class="right">0.1370039591</td><td class="right">0</td><td class="right">0</td><td class="right">0.1495258264</td><td class="right">0.1811987846</td><td class="right">0.0662922383</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.3610326745</td><td class="right">0.0968132311</td><td class="right">0.2662363856</td><td class="right">0.1549011698</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1210165389</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0784021727</td><td class="right">0</td><td class="right">0.1142431659</td><td class="right">0.1176032591</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1194893491</td><td class="right">0.0215605975</td><td class="right">0.093242584</td><td class="right">0.1127031233</td><td class="right">0</td><td class="right">0</td><td class="right">0.1121431077</td><td class="right">0.0983089744</td><td class="right">0.104862906</td><td class="right">0.0274407604</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">OCTOPUS</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0674902386</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1142142499</td><td class="right">0.1373908428</td><td class="right">0.1032203649</td><td class="right">0.1855981561</td><td class="right">0</td><td class="right">0</td><td class="right">0.1574772233</td><td class="right">0.0771317012</td><td class="right">0.0899869848</td><td class="right">0.0674902386</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0641443943</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1166261715</td><td class="right">0.1160708087</td><td class="right">0.11225269</td><td class="right">0.0962165915</td><td class="right">0</td><td class="right">0</td><td class="right">0.1069073238</td><td class="right">0.1924331829</td><td class="right">0.0991322457</td><td class="right">0.0962165915</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.2030669844</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1460657256</td><td class="right">0.1055948319</td><td class="right">0.169222487</td><td class="right">0.0714494945</td><td class="right">0</td><td class="right">0</td><td class="right">0.1015334922</td><td class="right">0.0676889948</td><td class="right">0.0676889948</td><td class="right">0.0676889948</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">SEA URCHIN</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0445542466</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0222771233</td><td class="right">0.1951900329</td><td class="right">0.093563918</td><td class="right">0.0811523778</td><td class="right">0.0687101635</td><td class="right">0</td><td class="right">0</td><td class="right">0.1169548975</td><td class="right">0.0891084933</td><td class="right">0.2160880962</td><td class="right">0.0724006508</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0445542466</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0222771233</td><td class="right">0.1951900329</td><td class="right">0.093563918</td><td class="right">0.0811523778</td><td class="right">0.0687101635</td><td class="right">0</td><td class="right">0</td><td class="right">0.1169548975</td><td class="right">0.0891084933</td><td class="right">0.2160880962</td><td class="right">0.0724006508</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0445542466</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0222771233</td><td class="right">0.1951900329</td><td class="right">0.093563918</td><td class="right">0.0811523778</td><td class="right">0.0687101635</td><td class="right">0</td><td class="right">0</td><td class="right">0.1169548975</td><td class="right">0.0891084933</td><td class="right">0.2160880962</td><td class="right">0.0724006508</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0445542466</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0222771233</td><td class="right">0.1951900329</td><td class="right">0.093563918</td><td class="right">0.0811523778</td><td class="right">0.0687101635</td><td class="right">0</td><td class="right">0</td><td class="right">0.1169548975</td><td class="right">0.0891084933</td><td class="right">0.2160880962</td><td class="right">0.0724006508</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">VIDRIOLA</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.043956044</td><td class="right">0.0879120879</td><td class="right">0.043956044</td><td class="right">0.2637362637</td><td class="right">0</td><td class="right">0</td><td class="right">0.1648351648</td><td class="right">0.043956044</td><td class="right">0.3076923077</td><td class="right">0.043956044</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0471698113</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1061320755</td><td class="right">0.0825471698</td><td class="right">0</td><td class="right">0.4811320755</td><td class="right">0</td><td class="right">0</td><td class="right">0.141509434</td><td class="right">0.0943396226</td><td class="right">0.0471698113</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.3403141361</td><td class="right">0.4123036649</td><td class="right">0</td><td class="right">0.247382199</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.3150984683</td><td class="right">0.5120350109</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0853391685</td><td class="right">0.0875273523</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">Small Crustacean</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0596908971</td><td class="right">0.0556210632</td><td class="right">0.0862445683</td><td class="right">0.0566597187</td><td class="right">0</td><td class="right">0</td><td class="right">0.3469533395</td><td class="right">0.1318173978</td><td class="right">0.1734766697</td><td class="right">0.0895363457</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0448457636</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.112114409</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1476173052</td><td class="right">0.0494849805</td><td class="right">0.045593193</td><td class="right">0.0287760316</td><td class="right">0</td><td class="right">0</td><td class="right">0.0840858068</td><td class="right">0.1843659171</td><td class="right">0.1502333081</td><td class="right">0.152883285</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0996254379</td><td class="right">0.062719857</td><td class="right">0.0730112138</td><td class="right">0.0445194333</td><td class="right">0</td><td class="right">0</td><td class="right">0.1761235421</td><td class="right">0.1958351466</td><td class="right">0.1404269237</td><td class="right">0.2077384456</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.2250866738</td><td class="right">0.0530634335</td><td class="right">0.0723386123</td><td class="right">0.0432514081</td><td class="right">0</td><td class="right">0</td><td class="right">0.1972871245</td><td class="right">0.1394162346</td><td class="right">0.0841066162</td><td class="right">0.185449897</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">Mollusca</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.2631578947</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1578947368</td><td class="right">0.3684210526</td><td class="right">0</td><td class="right">0.1578947368</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0526315789</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1818181818</td><td class="right">0.8181818182</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1357228718</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.746475795</td><td class="right">0.0528903945</td><td class="right">0.0649109387</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.460815047</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1880877743</td><td class="right">0.1536050157</td><td class="right">0.065830721</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.065830721</td><td class="right">0.065830721</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">Anguila</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1448842384</td><td class="right">0</td><td class="right">0.0231814781</td><td class="right">0.0434652715</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0144884238</td><td class="right">0.0338806219</td><td class="right">0.0190088121</td><td class="right">0.0405675867</td><td class="right">0</td><td class="right">0</td><td class="right">0.1225306702</td><td class="right">0.1837776073</td><td class="right">0.1757238834</td><td class="right">0.1984914066</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0388576886</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0400351943</td><td class="right">0.1086576108</td><td class="right">0.1878121617</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1521926138</td><td class="right">0.1493862251</td><td class="right">0.2043266793</td><td class="right">0.1187318263</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0223488142</td><td class="right">0.0275848221</td><td class="right">0.2145486162</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1802378653</td><td class="right">0.1713664502</td><td class="right">0.210611067</td><td class="right">0.1733023651</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0470617549</td><td class="right">0</td><td class="right">0.0062749007</td><td class="right">0.0439243046</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0728853846</td><td class="right">0.0608665364</td><td class="right">0.032695535</td><td class="right">0.0508050577</td><td class="right">0</td><td class="right">0</td><td class="right">0.1688247082</td><td class="right">0.1559761021</td><td class="right">0.1716112366</td><td class="right">0.1890744792</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">Orange Roughy</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1105920043</td><td class="right">0.1591136622</td><td class="right">0.3062804512</td><td class="right">0.0732163118</td><td class="right">0.0732163118</td><td class="right">0.0732163118</td><td class="right">0.0732163118</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0397116732</td><td class="right">0.0914369619</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1105920043</td><td class="right">0.1591136622</td><td class="right">0.3062804512</td><td class="right">0.0732163118</td><td class="right">0.0732163118</td><td class="right">0.0732163118</td><td class="right">0.0732163118</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0397116732</td><td class="right">0.0914369619</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1105920043</td><td class="right">0.1591136622</td><td class="right">0.3062804512</td><td class="right">0.0732163118</td><td class="right">0.0732163118</td><td class="right">0.0732163118</td><td class="right">0.0732163118</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0397116732</td><td class="right">0.0914369619</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1105920043</td><td class="right">0.1591136622</td><td class="right">0.3062804512</td><td class="right">0.0732163118</td><td class="right">0.0732163118</td><td class="right">0.0732163118</td><td class="right">0.0732163118</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0397116732</td><td class="right">0.0914369619</td></tr>
</tbody>
<tbody>
<tr><td class="left">Alfonsino</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0096696213</td><td class="right">0</td><td class="right">0.3464443997</td><td class="right">0.1187676269</td><td class="right">0.1187676269</td><td class="right">0.1187676269</td><td class="right">0.1187676269</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1688154714</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0096696213</td><td class="right">0</td><td class="right">0.3464443997</td><td class="right">0.1187676269</td><td class="right">0.1187676269</td><td class="right">0.1187676269</td><td class="right">0.1187676269</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1688154714</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0096696213</td><td class="right">0</td><td class="right">0.3464443997</td><td class="right">0.1187676269</td><td class="right">0.1187676269</td><td class="right">0.1187676269</td><td class="right">0.1187676269</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1688154714</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0096696213</td><td class="right">0</td><td class="right">0.3464443997</td><td class="right">0.1187676269</td><td class="right">0.1187676269</td><td class="right">0.1187676269</td><td class="right">0.1187676269</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.1688154714</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">Chondricties</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0</td><td class="right">0</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0</td><td class="right">0</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0</td><td class="right">0</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0</td><td class="right">0</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0.0666666667</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">Otariids</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.001880243</td><td class="right">0</td><td class="right">0.0914087359</td><td class="right">0.4117008967</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.4950101244</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.001880243</td><td class="right">0</td><td class="right">0.0914087359</td><td class="right">0.4117008967</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.4950101244</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.001880243</td><td class="right">0</td><td class="right">0.0914087359</td><td class="right">0.4117008967</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.4950101244</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.001880243</td><td class="right">0</td><td class="right">0.0914087359</td><td class="right">0.4117008967</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.4950101244</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">Cetaceous</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0.0051176062</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0248377648</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0067523971</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0067523971</td><td class="right">0</td><td class="right">0.0915340735</td><td class="right">0.0028431146</td><td class="right">0</td><td class="right">0</td><td class="right">0.0067523971</td><td class="right">0.3838204668</td><td class="right">0.0047977558</td><td class="right">0.0338804486</td><td class="right">0.0028431146</td><td class="right">0.0360127845</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0073920979</td><td class="right">0</td><td class="right">0</td><td class="right">0.0028431146</td><td class="right">0</td><td class="right">0.3838204668</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0.0051176062</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0248377648</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0067523971</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0067523971</td><td class="right">0</td><td class="right">0.0915340735</td><td class="right">0.0028431146</td><td class="right">0</td><td class="right">0</td><td class="right">0.0067523971</td><td class="right">0.3838204668</td><td class="right">0.0047977558</td><td class="right">0.0338804486</td><td class="right">0.0028431146</td><td class="right">0.0360127845</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0073920979</td><td class="right">0</td><td class="right">0</td><td class="right">0.0028431146</td><td class="right">0</td><td class="right">0.3838204668</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0.0051176062</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0248377648</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0067523971</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0067523971</td><td class="right">0</td><td class="right">0.0915340735</td><td class="right">0.0028431146</td><td class="right">0</td><td class="right">0</td><td class="right">0.0067523971</td><td class="right">0.3838204668</td><td class="right">0.0047977558</td><td class="right">0.0338804486</td><td class="right">0.0028431146</td><td class="right">0.0360127845</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0073920979</td><td class="right">0</td><td class="right">0</td><td class="right">0.0028431146</td><td class="right">0</td><td class="right">0.3838204668</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0.0051176062</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0248377648</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0067523971</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0067523971</td><td class="right">0</td><td class="right">0.0915340735</td><td class="right">0.0028431146</td><td class="right">0</td><td class="right">0</td><td class="right">0.0067523971</td><td class="right">0.3838204668</td><td class="right">0.0047977558</td><td class="right">0.0338804486</td><td class="right">0.0028431146</td><td class="right">0.0360127845</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0073920979</td><td class="right">0</td><td class="right">0</td><td class="right">0.0028431146</td><td class="right">0</td><td class="right">0.3838204668</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
<tbody>
<tr><td class="left">Birds</td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td><td class="right"></td></tr>
</tbody>
<tbody>
<tr><td class="left">S1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S3</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
<tr><td class="left">S4</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0.125</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td></tr>
</tbody>
</table>

</li>
<li><code>[X]</code> For lobster in winter distribution I use the mean between spring and autumm
</li>
<li><code>[X]</code> For Large pelagic fish, Mollusca, Octupus, Small bentic fish and small crustacean, I use the average distribution for all the seasons.
</li>
</ul>

</li>
<li><code>[X]</code> Deph Distribution
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Functional Groups</th><th scope="col" class="right">Min</th><th scope="col" class="right">Max</th><th scope="col" class="left">Author</th></tr>
</thead>
<tbody>
<tr><td class="left">SPL</td><td class="right">2</td><td class="right">250</td><td class="left">Retamal &amp; Arana 2000  - Descripcion y distribucion de 5 decapodos</td></tr>
<tr><td class="left">GCR</td><td class="right">100</td><td class="right">1000</td><td class="left">Arana et al 2000  -  Pesca exploratoria</td></tr>
<tr><td class="left">BRC</td><td class="right">20</td><td class="right">300</td><td class="left">Arana &amp; Vega 2000  -  Pesca exploratoria espinel and billy DB</td></tr>
<tr><td class="left">ORO</td><td class="right">500</td><td class="right">1000</td><td class="left">Niklitschek 2007 evaluacion hidroacustica alfonsino y otange roughy</td></tr>
<tr><td class="left">ALF</td><td class="right">200</td><td class="right">600</td><td class="left">Niklitschek 2007 evaluacion hidroacustica alfonsino y otange roughy</td></tr>
<tr><td class="left">LPF</td><td class="right">0</td><td class="right">200</td><td class="left">Billy data base</td></tr>
<tr><td class="left">SPF</td><td class="right">0</td><td class="right">250</td><td class="left">Billy data base</td></tr>
<tr><td class="left">SBF</td><td class="right">0</td><td class="right">250</td><td class="left">Billy data base</td></tr>
<tr><td class="left">LBF</td><td class="right">0</td><td class="right">250</td><td class="left">Billy data base</td></tr>
<tr><td class="left">VID</td><td class="right">3</td><td class="right">150</td><td class="left">IUCN and fish-base</td></tr>
<tr><td class="left">ANG</td><td class="right">0</td><td class="right">300</td><td class="left">Arana 2000 - PEsca exploratoria con trampa</td></tr>
</tbody>
</table>

</li>
<li><code>[X]</code> Day-nigth distribution [2/2]
<ul>
<li><code>[X]</code> Vertebrates
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">FG</th><th scope="col" class="left">JvAd</th><th scope="col" class="left">Ligth</th><th scope="col" class="right">Deepest</th><th scope="col" class="right"></th><th scope="col" class="right"></th><th scope="col" class="right"></th><th scope="col" class="right"></th><th scope="col" class="right"></th><th scope="col" class="right"></th><th scope="col" class="right">Surface</th><th scope="col" class="left">Source</th></tr>
</thead>
<tbody>
<tr><td class="left">ANG</td><td class="left">Both</td><td class="left">Both</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">Billy Database</td></tr>
<tr><td class="left">BRC</td><td class="left">Adult</td><td class="left">Both</td><td class="right">0.065894115</td><td class="right">0.0665757782</td><td class="right">0.0077255169</td><td class="right">0.0645307885</td><td class="right">0.3583276528</td><td class="right">0.2094978414</td><td class="right">0.1376959782</td><td class="right">0.089752329</td><td class="left">Billy Database</td></tr>
<tr><td class="left">BRC</td><td class="left">Juv</td><td class="left">Both</td><td class="right">0.0084033613</td><td class="right">0.037214886</td><td class="right">0.0288115246</td><td class="right">0.0336134454</td><td class="right">0.3709483794</td><td class="right">0.2088835534</td><td class="right">0.2172869148</td><td class="right">0.0948379352</td><td class="left">Billy Database</td></tr>
<tr><td class="left">LBF</td><td class="left">Both</td><td class="left">Both</td><td class="right">0</td><td class="right">0.0535714286</td><td class="right">0</td><td class="right">0.1160714286</td><td class="right">0.4553571429</td><td class="right">0.2053571429</td><td class="right">0.0982142857</td><td class="right">0.0714285714</td><td class="left">Billy Database</td></tr>
<tr><td class="left">LPF</td><td class="left">Both</td><td class="left">Both</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0031051079</td><td class="right">0.0009315324</td><td class="right">0.0099363453</td><td class="right">0.0353206024</td><td class="right">0.950706412</td><td class="left">Billy Database</td></tr>
<tr><td class="left">SBF</td><td class="left">Both</td><td class="left">Both</td><td class="right">0.223316913</td><td class="right">0.2561576355</td><td class="right">0.1871921182</td><td class="right">0.144499179</td><td class="right">0.0870279146</td><td class="right">0.0295566502</td><td class="right">0.039408867</td><td class="right">0.0328407225</td><td class="left">Billy Database</td></tr>
<tr><td class="left">SPF</td><td class="left">Both</td><td class="left">Both</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0684931507</td><td class="right">0</td><td class="right">0.0904109589</td><td class="right">0.1246575342</td><td class="right">0.7164383562</td><td class="left">Billy Database</td></tr>
<tr><td class="left">VID</td><td class="left">Both</td><td class="left">Both</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0051813472</td><td class="right">0.1191709845</td><td class="right">0.067357513</td><td class="right">0.103626943</td><td class="right">0.7046632124</td><td class="left">Billy Database</td></tr>
<tr><td class="left">ALF</td><td class="left">Both</td><td class="left">Both</td><td class="right">0.119487909</td><td class="right">0.0871266003</td><td class="right">0.1123755334</td><td class="right">0.4327880512</td><td class="right">0.1470483642</td><td class="right">0.0460526316</td><td class="right">0.0551209104</td><td class="right">0</td><td class="left">Billy Database</td></tr>
<tr><td class="left">ORO</td><td class="left">Both</td><td class="left">Both</td><td class="right">0.4119850187</td><td class="right">0.240948814</td><td class="right">0.3121098627</td><td class="right">0.0312109863</td><td class="right">0.0037453184</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">Billy Database</td></tr>
</tbody>
</table>

</li>
<li><code>[X]</code> Invertebrates
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">FG</th><th scope="col" class="left">Light</th><th scope="col" class="right">Deepest layer</th><th scope="col" class="right"></th><th scope="col" class="right"></th><th scope="col" class="right"></th><th scope="col" class="right"></th><th scope="col" class="right"></th><th scope="col" class="right"></th><th scope="col" class="right">Surface</th><th scope="col" class="left">Source</th></tr>
</thead>
<tbody>
<tr><td class="left">GCR</td><td class="left">D</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">Billy Database</td></tr>
<tr><td class="left">GCR</td><td class="left">N</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">Billy Database</td></tr>
<tr><td class="left">SPL</td><td class="left">D</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">Billy Database</td></tr>
<tr><td class="left">SPL</td><td class="left">N</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">Billy Database</td></tr>
<tr><td class="left">OCT</td><td class="left">D</td><td class="right">0.8</td><td class="right">0.2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">Billy Database</td></tr>
<tr><td class="left">OCT</td><td class="left">N</td><td class="right">0.5</td><td class="right">0.3</td><td class="right">0.2</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="left">Billy Database</td></tr>
<tr><td class="left">COP</td><td class="left">D</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0034546292</td><td class="right">0.1273606633</td><td class="right">0.3287655458</td><td class="right">0.5404191617</td><td class="right">0</td><td class="left">Antesana  2009</td></tr>
<tr><td class="left">COP</td><td class="left">N</td><td class="right">0.0295087372</td><td class="right">0.0602538741</td><td class="right">0.0787174415</td><td class="right">0.0787174415</td><td class="right">0.0492087043</td><td class="right">0.0049455984</td><td class="right">0.0085723706</td><td class="right">0.6900758325</td><td class="left">Antesana 2009</td></tr>
<tr><td class="left">EUF</td><td class="left">D</td><td class="right">0</td><td class="right">0.021312873</td><td class="right">0.028417164</td><td class="right">0.1449275362</td><td class="right">0.0824097755</td><td class="right">0.2750781472</td><td class="right">0.2810457516</td><td class="right">0.1668087525</td><td class="left">Hidalgo,2005</td></tr>
<tr><td class="left">EUF</td><td class="left">N</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0.0044113875</td><td class="right">0.2979738394</td><td class="right">0.697614773</td><td class="left">Hidalgo, 2005</td></tr>
<tr><td class="left">SUR</td><td class="left">D</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right"></td><td class="right"></td><td class="left"></td></tr>
<tr><td class="left">SUR</td><td class="left">N</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right"></td><td class="right"></td><td class="left"></td></tr>
<tr><td class="left">MOL</td><td class="left">D</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right"></td><td class="right"></td><td class="left"></td></tr>
<tr><td class="left">MOL</td><td class="left">N</td><td class="right">1</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right">0</td><td class="right"></td><td class="right"></td><td class="left"></td></tr>
</tbody>
</table>

</li>
</ul>

</li>
<li><code>[X]</code> Speed movement
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Functional group</th><th scope="col" class="left">Speed m.hr-1</th><th scope="col" class="left">Specie or group</th><th scope="col" class="left">Real speed reported</th><th scope="col" class="left">Source</th></tr>
</thead>
<tbody>
<tr><td class="left">SPL</td><td class="left">1260</td><td class="left">Lobster</td><td class="left">35 cm*sec-1</td><td class="left">Childress and Jury. Chapter 3-behaviour</td></tr>
<tr><td class="left">GCR</td><td class="left">450</td><td class="left">Gost crab</td><td class="left">0.45 K*h</td><td class="left">Tully and andrus 2011</td></tr>
<tr><td class="left">BRC</td><td class="left">2228</td><td class="left">Acanthuridae</td><td class="left">61.9cm*s</td><td class="left">Fulton et al. 2005</td></tr>
<tr><td class="left">ORO</td><td class="left">1440</td><td class="left">Trachinidae</td><td class="left">0.4 m*s</td><td class="left">Fishbase</td></tr>
<tr><td class="left">ALF</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">CHO</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">BIR</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">LPF</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">SPF</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">LBF</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">SBF</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">EUP</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">COP</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">SUR</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">MOL</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
</tbody>
</table>

</li>
<li><code>[X]</code> look for the depth distribution of the functional groups
  For this, I use the information in SETas model and references
</li>
<li><code>[X]</code> Migration
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Species</th><th scope="col" class="left">Month</th><th scope="col" class="left">Reference</th></tr>
</thead>
<tbody>
<tr><td class="left">Vidriola</td><td class="left">Spring-Summer</td><td class="left">Arana 2000b</td></tr>
<tr><td class="left">Whales</td><td class="left">Leave during winter</td><td class="left"></td></tr>
<tr><td class="left">Birds</td><td class="left">Srping and summer</td><td class="left">OIKONOS</td></tr>
</tbody>
</table>


<ul>
<li>Vidriola catch analisys



<pre class="src src-R"><span style="color: #696969;">##</span><span style="color: #696969;">libraries</span>
<span style="color: #ff4500; font-weight: bold;">library</span>(ggplot2)
setwd(<span style="color: #ffc125; font-weight: bold;">"/home/demiurgo/Documents/PhD/Functional_groups/Migration/Vidriola/"</span>)
vid.io            <span style="color: #ff4500; font-weight: bold;">&lt;-</span> read.table(<span style="color: #ffc125; font-weight: bold;">'Vid_month.txt'</span>, sep = <span style="color: #ffc125; font-weight: bold;">' '</span>, header = <span style="color: #fffacd; font-weight: bold;">TRUE</span>)
s                 <span style="color: #ff4500; font-weight: bold;">&lt;-</span> qplot(as.factor(Month), Weight, data = vid.io, geom=c(<span style="color: #ffc125; font-weight: bold;">"boxplot"</span>), xlab = <span style="color: #ffc125; font-weight: bold;">'Month'</span>, ylab = <span style="color: #ffc125; font-weight: bold;">'Biomass (kg)'</span>)
mean.month        <span style="color: #ff4500; font-weight: bold;">&lt;-</span> with(vid.io, aggregate(Weight~as.factor(Month), FUN = mean))
mean.month$Weight <span style="color: #ff4500; font-weight: bold;">&lt;-</span> mean.month$Weight / sum(mean.month$Weight)
png(<span style="color: #ffc125; font-weight: bold;">'migration_Vid.png'</span>)
par(mar=c(5,4,4,5)+.1)
boxplot(Weight~as.factor(Month), data = vid.io, col = <span style="color: #ffc125; font-weight: bold;">'grey'</span>, bty = <span style="color: #ffc125; font-weight: bold;">'n'</span>, outline = <span style="color: #fffacd; font-weight: bold;">FALSE</span>, xlab = <span style="color: #ffc125; font-weight: bold;">'Months'</span>, ylab = <span style="color: #ffc125; font-weight: bold;">'Catch (Number)'</span>, border = <span style="color: #ffc125; font-weight: bold;">'white'</span>, las = 1,
        main = <span style="color: #ffc125; font-weight: bold;">'Vidriola Migration'</span>)
par(new = <span style="color: #fffacd; font-weight: bold;">TRUE</span>)
plot(as.numeric(mean.month[, 1]), mean.month[, 2], type = <span style="color: #ffc125; font-weight: bold;">'b'</span>, pch = 20, col = 2, axes = F, xlab = <span style="color: #ffc125; font-weight: bold;">''</span>, ylab = <span style="color: #ffc125; font-weight: bold;">''</span>, bty = <span style="color: #ffc125; font-weight: bold;">'n'</span>)
axis(4, col = 2, las = 1)
mtext(<span style="color: #ffc125; font-weight: bold;">"Proportion"</span>, side=4, line=3)
dev.off()
</pre>

</li>
</ul>

</li>
<li>Initial condition (Abundance) for migrating species
<ul>
<li>For Vidriola I use the length converted catch curve to estimate Z.



<pre class="src src-R"><span style="color: #696969;">#</span><span style="color: #696969;">-------------------------------------#</span>
<span style="color: #696969;"># </span><span style="color: #696969;">Estimation of abundance using APV   #</span>
<span style="color: #696969;">#</span><span style="color: #696969;">------------------------------------ #</span>
vid.io            <span style="color: #ff4500; font-weight: bold;">&lt;-</span> read.table(<span style="color: #ffc125; font-weight: bold;">'/home/demiurgo/Documents/PhD/Functional_groups/Migration/Vidriola/Vid_month.txt'</span>, sep = <span style="color: #ffc125; font-weight: bold;">' '</span>, header = <span style="color: #fffacd; font-weight: bold;">TRUE</span>)
lfd               <span style="color: #ff4500; font-weight: bold;">&lt;-</span> read.csv(<span style="color: #ffc125; font-weight: bold;">'/home/demiurgo/Documents/PhD/Functional_groups/Migration/Vidriola/VID.csv'</span>)
sum.season        <span style="color: #ff4500; font-weight: bold;">&lt;-</span> with(vid.io, aggregate(Weight~as.factor(Season), FUN = sum))
dist              <span style="color: #ff4500; font-weight: bold;">&lt;-</span> lfd$count/sum(lfd$count)
mean.month        <span style="color: #ff4500; font-weight: bold;">&lt;-</span> with(vid.io, aggregate(Weight~as.factor(Month), FUN = mean))
mean.month$Weight <span style="color: #ff4500; font-weight: bold;">&lt;-</span> mean.month$Weight / sum(mean.month$Weight)
vec               <span style="color: #ff4500; font-weight: bold;">&lt;-</span> c(t(outer(sum.season[8:10,2],mean.month[,2])))
total             <span style="color: #ff4500; font-weight: bold;">&lt;-</span> t(outer(vec, dist))
dates             <span style="color: #ff4500; font-weight: bold;">&lt;-</span> format(seq(as.Date(<span style="color: #ffc125; font-weight: bold;">'2013-01-30'</span>), by=<span style="color: #ffc125; font-weight: bold;">'months'</span>,length.out=36), <span style="color: #ffc125; font-weight: bold;">'%d/%m/%Y'</span>)
colnames(total)   <span style="color: #ff4500; font-weight: bold;">&lt;-</span> as.character(dates)
total             <span style="color: #ff4500; font-weight: bold;">&lt;-</span> cbind(id=lfd[,2],total)
<span style="color: #696969;"># </span><span style="color: #696969;">write.table(total, 'Vid_lccc.txt',row.names=FALSE,sep=',')</span>
<span style="color: #696969;">#</span><span style="color: #696969;">~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~#</span>
<span style="color: #696969;">#  </span><span style="color: #696969;">Using length converted catch curve to estimate z  #</span>
<span style="color: #696969;">#</span><span style="color: #696969;">~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~#</span>
<span style="color: #696969;"># </span><span style="color: #696969;">source('ElefanI.R')</span>
<span style="color: #ff4500; font-weight: bold;">source</span>(<span style="color: #ffc125; font-weight: bold;">'/home/demiurgo/Documents/PhD/Functional_groups/Migration/Vidriola/Lccc.R'</span>)
<span style="color: #696969;"># </span><span style="color: #696969;">ElefanI(data, vbplot = TRUE)</span>
data <span style="color: #ff4500; font-weight: bold;">&lt;-</span> <span style="color: #ffc125; font-weight: bold;">'/home/demiurgo/Documents/PhD/Functional_groups/Migration/Vidriola/Vid_lccc.txt'</span>
dat  <span style="color: #ff4500; font-weight: bold;">&lt;-</span> Lccc(data, Linf = 964.95, K = 0.82, auto = <span style="color: #fffacd; font-weight: bold;">FALSE</span>, save = <span style="color: #fffacd; font-weight: bold;">TRUE</span>, quiet = <span style="color: #fffacd; font-weight: bold;">TRUE</span>)
Z    <span style="color: #ff4500; font-weight: bold;">&lt;-</span> dat$Z_Estimate[1]
M    <span style="color: #ff4500; font-weight: bold;">&lt;-</span> 0.2
<span style="color: #696969;"># </span><span style="color: #696969;">-  -  -  -  -  -  -  -  -  -  -  -  -  - #</span>
<span style="color: #696969;"># </span><span style="color: #696969;">Last abundance  Using Baranov equation    #</span>
<span style="color: #696969;"># </span><span style="color: #696969;">-  -  -  -  -  -   -  -  -  -  -  -  - - #</span>
abun.l <span style="color: #ff4500; font-weight: bold;">&lt;-</span> (sum.season[10, 2] * Z) / ((Z - M) * (1 - exp( -  Z)))
cat(abun.l)
</pre>


</li>
<li>the values of Z and natural moratily for Vidriola area
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Location</th><th scope="col" class="right">Natural moratality</th><th scope="col" class="left">Reference</th></tr>
</thead>
<tbody>
<tr><td class="left">New zealand</td><td class="right">0.2</td><td class="left">Holdsworth et al (2013)</td></tr>
<tr><td class="left">Z</td><td class="right">2.35</td><td class="left">Using LCCC</td></tr>
</tbody>
</table>

</li>
</ul>

</li>
</ul>



</li>
</ul>
<ul>
