MandM/Methods.org
**** Bibliography that I need
 - [ ] Sepulveda y Pequeño,  Fauna ictica del archipielago de Juan Fernandez. En P. Arana (ed). Investigaciones Marinas en el Archipiélago de Juan Fernández. Esc. Ciencias del Mar, UCV, Valparaíso
 - [ ] Meléndez, C.R. y C. Villalba. 1992. Nuevos registros y antecedentes para la ictiofauna del archipiélago de Juan Fernández, Chile. Estud. Oceanol. 11 : 3 - 29
 - [ ] TORRES D (1987) Antecedentes sobre el lobo fino de Juan Fernández Arctocephalus philippii y proyecciones para su estudio. In: Castilla JC (ed) Islas oceánicas chilenas: conocimiento científico y necesidades de investigaciones: 287-317. Ediciones Universidad Católica de Chile, Santiago, Chile.

**** Codes
| Code | Functional Groups    |   | Simil SETas | Other |
|------+----------------------+---+-------------+-------|
| SPL  | Spiny lobster        |   |             |       |
| GCR  | Golden Crab          |   | BMD         |       |
| BRC  | Breca                |   | FPO         | FPS   |
| VID  | Vidriola             |   | FVT         | FVO   |
| ORO  | Orange Roughy        |   | FDF         | FDD   |
| ALF  | Alfonsino            |   | FDD         | FDM   |
| ANG  | Anguila              |   | FVD         | FVD   |
| CHO  | Chondrichtyans       |   | SHB         |       |
| OTA  | Otariid              |   | PIN         |       |
| CET  | Cetaceans            |   | WHS         | WHB   |
| BIR  | Birds                |   | SB          |       |
| OCT  | Octupus              |   | CEP         |       |
| SUR  | Sea urchins          |   | BFS         | BFF   |
| MOL  | Mollusca             |   | BFS         | BFF   |
| SCR  | Small crustaceans    |   | BMD         |       |
| LPF  | Large pelagic fish   |   | FVS         | FDE   |
| SPF  | Small pelagic fish   |   | FVS         |       |
| SBF  | Small benthic fish   |   | FDS         | FDD   |
| LBF  | Large benthic fish   |   | FVD         | FDD   |
| SZO  | Small Zooplankton    |   |             |       |
| MZO  | Medium Zooplankton   |   |             |       |
| LZO  | Large Zooplankton    |   |             |       |
| BFF  | Deposit feeders      |   |             |       |
| LPH  | Large phytoplankton  |   |             |       |
| SPH  | Small phytoplankton  |   |             |       |
| NO   | Nitrate              |   |             |       |
| MA   | Macroalgae           |   |             |       |
| PB   | Pelagic Bacteria     |   |             |       |
| BB   | Sediment Bacteria    |   |             |       |
| DL   | Labile detritus      |   |             |       |
| DR   | Refractory detritrus |   |             |       |
| DC   | Carrion              |   |             |       |
|------+----------------------+---+-------------+-------|
**** Dietary analysis (DNA)
***** NGS
      I will use NGS for the analysis of the dietary relationship between the functional groups
****** Procedure
 - DNA-extraccion
   - Feacal extraction kit
     - PowerFecal DNA Isolation Kit code : MB-12830-50
       Price : $439.00 ex. GST. kit of 50
 - Concentration determination
   - Fluorecense at UTAS
 - Amplicon PCR
   - Tailed primers  + 10% untailed primers
     - Primers
       - Furseal
       - Lobster
       - Fish
   - Taq polymerase
   - ddH2O
 - Clean Up
 - Gel
   To check if PCR works
 - Index PCR
   - Nextera index kit
   - Kapa mix
   - ddH2O
 - Checking PCR
 - Quantify amount of DNA
   - Quantiflour kit
 - Normalize the samples
 - Pool all the samples
 - Sequence in illumina MiSeq
   - Sequencing reagents (1500 for ??)

***** Cost
   | Step                | Total Amount | Price unit          | Total Price (182) | Total (96) |
   |---------------------+--------------+---------------------+-------------------+------------|
   | Consumables         |          Lot | 300                 |               300 |        300 |
   | DNA-Extraccion      |           96 | 439(kit 50)         |              1756 |        878 |
   | Cons. Determination |           96 | Unknow              |                   |            |
   | Amplicon-PCR        |           96 | 40 (96-well plate)  |                80 |         40 |
   | Gel                 |           96 |                     |                   |            |
   | Cleanup             |           96 | 8 (10 samples)      |               160 |         80 |
   | Index-PCR           |           96 | 800 (96-well plate) |              1600 |        800 |
   | Gel                 |              |                     |                   |            |
   | Clean-up            |           96 | 8 (10 samples)      |               160 |         80 |
   | Gel                 |              |                     |                   |            |
   | Sequence Ilumina    |           96 | 1500 (regents)      |              1500 |       1500 |
   |---------------------+--------------+---------------------+-------------------+------------|
   |                     |              | Total               |              5256 |            |
#+TBLFM: $4=vsum(@3$4..@12$4)

***** Functional groups
  | Functional Groups  | Current Number | Needed | Total |   |
  |--------------------+----------------+--------+-------+---|
  | Spiny_lobster      |                |     18 |  -161 |   |
  | Golden_Crab        |              1 |     17 |       |   |
  | Breca              |              8 |     10 |       |   |
  | Vidriola           |              2 |     16 |       |   |
  | Anguila            |                |     18 |       |   |
  | Otariid            |              2 |     16 |       |   |
  | Octupus            |              3 |     15 |       |   |
  | Large pelagic fish |              2 |     16 |       |   |
  | Small pelagic fish |                |     18 |       |   |
  | Small benthic fish |              1 |     17 |       |   |
  | Large benthic fish |                |     18 |       |   |
  |--------------------+----------------+--------+-------+---|
  | Per groups         |             18 |        |       |   |
#+TBLFM: $3=$VAL-$2::$4=:$VAL-vsum(@2$3..@12$3)::@2$4=$VAL-vsum(@2$3..@12$3)
#+CONSTANTS: VAL=@13$2

***** Clasification and samples
    | Functional Group   | Species              | N-Samples | adviced | Needed |
    |--------------------+----------------------+-----------+---------+--------|
    | Lobster            | Lobster              |         0 |         |        |
    |--------------------+----------------------+-----------+---------+--------|
    | Golden Crab        | Golden Crab          |         1 |         |        |
    |--------------------+----------------------+-----------+---------+--------|
    | Breca              | Breca                |         8 |         |        |
    |--------------------+----------------------+-----------+---------+--------|
    | Octopus            | Octopus              |         4 |         |        |
    |--------------------+----------------------+-----------+---------+--------|
    | Small Crustacean   | Jaiva                |           |         |        |
    |                    | King crab            |           |         |        |
    |--------------------+----------------------+-----------+---------+--------|
    | Anguila            | Anguila              |           |         |        |
    |--------------------+----------------------+-----------+---------+--------|
    | Large Benthic Fish | Bacalao              |           |         |        |
    |                    | Tollo                |           |         |        |
    |                    | Lenguado             |           |         |        |
    |                    | Congrio              |           |         |        |
    |--------------------+----------------------+-----------+---------+--------|
    | Small Benthic Fish | Colorado             |           |         |        |
    |                    | Graniento            |           |         |        |
    |                    | Cabrilla             |           |         |        |
    |                    | Chancharro           |         1 |         |        |
    |--------------------+----------------------+-----------+---------+--------|
    | Large Pelagic Fish | Corvina              |         1 |         |        |
    |                    | Jurel                |         1 |         |        |
    |                    | Jurelillo            |         1 |         |        |
    |--------------------+----------------------+-----------+---------+--------|
    | Small pelagic Fish | Pampanito            |           |         |        |
    |                    | Pez Mariposa         |         1 |         |        |
    |                    | Jerguilla            |           |         |        |
    |--------------------+----------------------+-----------+---------+--------|
    | Pinnipedo          | Furseal              |         2 |         |        |
    |--------------------+----------------------+-----------+---------+--------|
    | Vidriola           | Yellowtail amberjack |         8 |         |        |
    |--------------------+----------------------+-----------+---------+--------|
    | Total              |                      |        28 |         |        |
    #+TBLFM: $3=vsum(@2$3..@24$3)::@25$3=vsum(@2$3..@24$3)
