MandM/Methods.html
<li id="sec-5-2-1-2">Bibliography that I need<br/>
<ul>
<li><code>[&nbsp;]</code> Sepulveda y Pequeo,  Fauna ictica del archipielago de Juan Fernandez. En P. Arana (ed). Investigaciones Marinas en el Archipilago de Juan Fernndez. Esc. Ciencias del Mar, UCV, Valparaso
</li>
<li><code>[&nbsp;]</code> Melndez, C.R. y C. Villalba. 1992. Nuevos registros y antecedentes para la ictiofauna del archipilago de Juan Fernndez, Chile. Estud. Oceanol. 11 : 3 - 29
</li>
<li><code>[&nbsp;]</code> TORRES D (1987) Antecedentes sobre el lobo fino de Juan Fernndez Arctocephalus philippii y proyecciones para su estudio. In: Castilla JC (ed) Islas ocenicas chilenas: conocimiento cientfico y necesidades de investigaciones: 287-317. Ediciones Universidad Catlica de Chile, Santiago, Chile.
</li>
</ul>


</li>
</ul>
<ul>
<li id="sec-5-2-1-3">Codes<br/>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Code</th><th scope="col" class="left">Functional Groups</th><th scope="col" class="left"></th><th scope="col" class="left">Simil SETas</th><th scope="col" class="left">Other</th></tr>
</thead>
<tbody>
<tr><td class="left">SPL</td><td class="left">Spiny lobster</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">GCR</td><td class="left">Golden Crab</td><td class="left"></td><td class="left">BMD</td><td class="left"></td></tr>
<tr><td class="left">BRC</td><td class="left">Breca</td><td class="left"></td><td class="left">FPO</td><td class="left">FPS</td></tr>
<tr><td class="left">VID</td><td class="left">Vidriola</td><td class="left"></td><td class="left">FVT</td><td class="left">FVO</td></tr>
<tr><td class="left">ORO</td><td class="left">Orange Roughy</td><td class="left"></td><td class="left">FDF</td><td class="left">FDD</td></tr>
<tr><td class="left">ALF</td><td class="left">Alfonsino</td><td class="left"></td><td class="left">FDD</td><td class="left">FDM</td></tr>
<tr><td class="left">ANG</td><td class="left">Anguila</td><td class="left"></td><td class="left">FVD</td><td class="left">FVD</td></tr>
<tr><td class="left">CHO</td><td class="left">Chondrichtyans</td><td class="left"></td><td class="left">SHB</td><td class="left"></td></tr>
<tr><td class="left">OTA</td><td class="left">Otariid</td><td class="left"></td><td class="left">PIN</td><td class="left"></td></tr>
<tr><td class="left">CET</td><td class="left">Cetaceans</td><td class="left"></td><td class="left">WHS</td><td class="left">WHB</td></tr>
<tr><td class="left">BIR</td><td class="left">Birds</td><td class="left"></td><td class="left">SB</td><td class="left"></td></tr>
<tr><td class="left">OCT</td><td class="left">Octupus</td><td class="left"></td><td class="left">CEP</td><td class="left"></td></tr>
<tr><td class="left">SUR</td><td class="left">Sea urchins</td><td class="left"></td><td class="left">BFS</td><td class="left">BFF</td></tr>
<tr><td class="left">MOL</td><td class="left">Mollusca</td><td class="left"></td><td class="left">BFS</td><td class="left">BFF</td></tr>
<tr><td class="left">SCR</td><td class="left">Small crustaceans</td><td class="left"></td><td class="left">BMD</td><td class="left"></td></tr>
<tr><td class="left">LPF</td><td class="left">Large pelagic fish</td><td class="left"></td><td class="left">FVS</td><td class="left">FDE</td></tr>
<tr><td class="left">SPF</td><td class="left">Small pelagic fish</td><td class="left"></td><td class="left">FVS</td><td class="left"></td></tr>
<tr><td class="left">SBF</td><td class="left">Small benthic fish</td><td class="left"></td><td class="left">FDS</td><td class="left">FDD</td></tr>
<tr><td class="left">LBF</td><td class="left">Large benthic fish</td><td class="left"></td><td class="left">FVD</td><td class="left">FDD</td></tr>
<tr><td class="left">SZO</td><td class="left">Small Zooplankton</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">MZO</td><td class="left">Medium Zooplankton</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">LZO</td><td class="left">Large Zooplankton</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">BFF</td><td class="left">Deposit feeders</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">LPH</td><td class="left">Large phytoplankton</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">SPH</td><td class="left">Small phytoplankton</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">NO</td><td class="left">Nitrate</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">MA</td><td class="left">Macroalgae</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">PB</td><td class="left">Pelagic Bacteria</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">BB</td><td class="left">Sediment Bacteria</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">DL</td><td class="left">Labile detritus</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">DR</td><td class="left">Refractory detritrus</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">DC</td><td class="left">Carrion</td><td class="left"></td><td class="left"></td><td class="left"></td></tr>
</tbody>
</table>


</li>
</ul>
<ul>
